function formRoutine(){
	var cloneMessId = 0;
	var tIndex = 0;
	var doEdit = false;
	var cloneMessType = '';
	var formName = '';

	var pmo2Field = {
		  cell_1:    {'label' : 'Теплоисточник (название, расположение)',  'type' : 't' }, 
		  cell_2:    {'label' : 'Принадлежность (Муниципальная:Ведомственная)',  'type' : 'b', 'options' :  {"Муниципальный" : 'Муниципальный', "Ведомственный" : 'Ведомственный'}},
		  cell_3:    {'label' : 'Период работы (Зима:Зима+Лето)',  'type' : 'b', 'options' :  {"Зима" : 'Зима', "Зима+Лето" : 'Зима+Лето'} },
		  cell_4:    {'label' : 'Уст. мощн. (Гкал/ч)',  'type' : 'f' },
		  cell_5:    {'label' : 'Расч. нагрузка (Гкал/ч)',  'type' : 'f' },
		  cell_6:    {'label' : 'Кол-во котлов',  'type' : 'f' },
		  cell_7:    {'label' : 'Год ввода',  'type' : 'f' },
		  cell_8:    {'label' : 'Материал',  'type' : 't' },
		  cell_9:    {'label' : 'Высота (м)',  'type' : 'f' },
		  cell_10:    {'label' : 'Объем (м3)',  'type' : 'f' },
		  cell_11:    {'label' : 'Топливо',  'type' : 't' },
		  cell_12:    {'label' : 'Расход топлива (тн/год)',  'type' : 'f' },
		  cell_13:    {'label' : 'Расход эл.энергии (тыс.кВт*ч/год)',  'type' : 'f' },
		  cell_14:    {'label' : 'Расход воды (тыс.м3/год)',  'type' : 'f' },
		  cell_15:    {'label' : 'Цена топлива (руб/тн)',  'type' : 'f' },
		  cell_16:    {'label' : 'Цена эл. энергии (руб/кВт*ч)',  'type' : 'f' },
		  cell_17:    {'label' : 'Цена воды (руб/м3)',  'type' : 'f' },
		  cell_18:    {'label' : 'Тариф (руб/Гкал)',  'type' : 'f' },
		  cell_19:    {'label' : 'Персонал (чел)',  'type' : 'f' },
		  cell_20:    {'label' : 'Жесткость воды (мг-экв/л)',  'type' : 't' },
		  cell_21:    {'label' : 'ХВО (Да:Нет)',  'type' : 'b' , 'options' :  {"Да" : 'Да', "Нет" : 'Нет'}},
		  cell_22:    {'label' : 'Деаэрация (Да:Нет)',  'type' : 'b'  , 'options' :  {"Да" : 'Да', "Нет" : 'Нет'}},
		  cell_23:    {'label' : 'Теплосчетчик (Да:Нет)',  'type' : 'b'  , 'options' :  {"Да" : 'Да', "Нет" : 'Нет'}},
		  cell_24:    {'label' : 'Дробилка (Да:Нет)',  'type' : 'b'  , 'options' :  {"Да" : 'Да', "Нет" : 'Нет'}},
		  cell_25:    {'label' : 'ШЗУ',  'type' : 't' },
		  cell_26:    {'label' : 'Запас воды (м3)',  'type' : 'f' },
		  cell_27:    {'label' : 'ДЭС (кВт)',  'type' : 'f' },
		  cell_28:    {'label' : 'Темп. график (°С)',  'type' : 't' },
		  cell_29:    {'label' : 'Отапливаемые объекты Муниц. ж/дома (ед)',  'type' : 'f' },
		  cell_30:    {'label' : 'Отапливаемые объекты Муниц. ж/дома (тыс м2)',  'type' : 'f' },
		  cell_31:    {'label' : 'Отапливаемые объекты Ведом. ж/дома (ед)',  'type' : 'f' },
		  cell_32:    {'label' : 'Отапливаемые объекты Ведом. ж/дома (тыс м2)',  'type' : 'f' },
		  cell_33:    {'label' : 'Отапливаемые объекты Частные жил. дома (ед)',  'type' : 'f' },
		  cell_34:    {'label' : 'Отапливаемые объекты Частные ж/дома(тыс м2)',  'type' : 'f' },
		  cell_35:    {'label' : 'Отапливаемые объекты Соц-культ-быт (ед)',  'type' : 'f' },
		  cell_36:    {'label' : 'Отапливаемые объекты Соцкульт-быт (тыс м2)',  'type' : 'f' },
		  cell_37:    {'label' : 'Отапливаемые объекты Прочие (ед)',  'type' : 'f' },
		  cell_38:    {'label' : 'Отапливаемые объекты Прочие (тыс м2)',  'type' : 'f' },
		  cell_40:    {'label' : 'Обслуживающая организация',  'type' : 't' },
		  cell_41:    {'label' : 'Отпуск тепла (Гкал/год)',  'type' : 'f' },
		  cell_42:    {'label' : 'Удельный расход условного топлива (кг/Гкал или кг/м3)',  'type' : 'f' },
		  cell_43:    {'label' : 'Калорийность топлива (ккал/кг или ккал/м3)',  'type' : 'f' },
		  cell_44:    {'label' : 'ННЗТ (уголь/т)',  'type' : 'f' },
		  cell_45:    {'label' : 'НЭЗТ (уголь/т)',  'type' : 'f' },
		  cell_46:    {'label' : 'ННЗТ (жидкое/т)',  'type' : 'f' },
		  cell_47:    {'label' : 'НЭЗТ (жидкое/т)',  'type' : 'f' },
		  cell_39:    {'label' : 'Примечания',  'type' : 't' } 
		};	
		
		
	var pmo9Field = {
			cell_1 	 : {'label' : 'Наличие АРИЭ на объектах теплоснабжения до 100 кВт. (ед.) ', 'type' : 'f' },
			cell_2 	 : {'label' : 'Наличие АРИЭ на объектах теплоснабжения до 100 кВт. (кВт.) ', 'type' : 'f' },
			cell_3 	 : {'label' : 'Наличие АРИЭ на объектах теплоснабжения от 100 до 200 кВт. (ед.) 	', 'type' : 'f' },
			cell_4 	 : {'label' : 'Наличие АРИЭ на объектах теплоснабжения от 100 до 200 кВт. (кВт.) ', 'type' : 'f' },
			cell_5 	 : {'label' : 'Наличие АРИЭ на объектах теплоснабжения более 200 кВт. (ед.) 	', 'type' : 'f' },
			cell_6 	 : {'label' : 'Наличие АРИЭ на объектах теплоснабжения более 200 кВт. (кВт.) 	', 'type' : 'f' },
			cell_7 	 : {'label' : 'Наличие АРИЭ на объектах теплоснабжения наименование объекта, адрес объекта, марка АРИЭ, мощность, количество ', 'type' : 't' },
			cell_8 	 : {'label' : 'Наличие АРИЭ на объектах водоснабжения до 100 кВт. (ед.) ', 'type' : 'f' },
			cell_9 	 : {'label' : 'Наличие АРИЭ на объектах водоснабжения до 100 кВт. (кВт.) ', 'type' : 'f' },
			cell_10 	 : {'label' : 'Наличие АРИЭ на объектах водоснабжения от 100 до 200 кВт. (ед.) 	', 'type' : 'f' },
			cell_11 	 : {'label' : 'Наличие АРИЭ на объектах водоснабжения от 100 до 200 кВт. (кВт.) 	', 'type' : 'f' },
			cell_12 	 : {'label' : 'Наличие АРИЭ на объектах водоснабжения более 200 кВт. (ед.) 	', 'type' : 'f' },
			cell_13 	 : {'label' : 'Наличие АРИЭ на объектах водоснабжения более 200 кВт. (кВт.) ', 'type' : 'f' },
			cell_14 	 : {'label' : 'Наличие АРИЭ на объектах водоснабжения наименование объекта, адрес объекта, марка АРИЭ, мощность, количество ', 'type' : 't' },
			cell_15 	 : {'label' : 'Наличие АРИЭ на объектах на объектах СКБ до 100 кВт. (ед.) ', 'type' : 'f' },
			cell_16 	 : {'label' : 'Наличие АРИЭ на объектах на объектах СКБ до 100 кВт. (кВт.) ', 'type' : 'f' },
			cell_17 	 : {'label' : 'Наличие АРИЭ на объектах на объектах СКБ от 100 до 200 кВт. (ед.) ', 'type' : 'f' },
			cell_18 	 : {'label' : 'Наличие АРИЭ на объектах на объектах СКБ от 100 до 200 кВт. (кВт.) ', 'type' : 'f' },
			cell_19 	 : {'label' : 'Наличие АРИЭ на объектах на объектах СКБ более 200 кВт. (ед.) ', 'type' : 'f' },
			cell_20 	 : {'label' : 'Наличие АРИЭ на объектах на объектах СКБ более 200 кВт. (кВт.) ', 'type' : 'f' },
			cell_21 	 : {'label' : 'Наличие АРИЭ на объектах на объектах СКБ наименование объекта, адрес объекта, марка АРИЭ, мощность, количество ', 'type' : 't' },
			cell_22 	 : {'label' : 'Потребность в АРИЭ до 100 кВт. (ед.) ', 'type' : 'f' },
			cell_23	 : {'label' : 'Потребность в АРИЭ до 100 кВт. (кВт.) ', 'type' : 'f' },
			cell_24	 : {'label' : 'Потребность в АРИЭ от 100 до 200 кВт. (ед.) 	', 'type' : 'f' },
			cell_25	 : {'label' : 'Потребность в АРИЭ от 100 до 200 кВт. (кВт.) ', 'type' : 'f' },
			cell_26 	 : {'label' : 'Потребность в АРИЭ более 200 кВт. (ед.) ', 'type' : 'f' },
			cell_27	 : {'label' : 'Потребность в АРИЭ более 200 кВт. (кВт.) ', 'type' : 'f' },
			cell_28 	 : {'label' : 'Потребность в АРИЭ наименование объекта, адрес объекта, марка АРИЭ, мощность, количество ', 'type' : 't' }
			};
	var pmo8Field = {
			cell_1 	 : {'label' : 'Гостиницы количество (ед.) ', 'type' : 'f' },
			cell_2 	 : {'label' : 'Гостиницы койко-мест (ед.) ', 'type' : 'f' },
			cell_3 	 : {'label' : 'Бани количество (ед.) ', 'type' : 'f' },
			cell_4 	 : {'label' : 'Бани помыв. мест (ед.) ', 'type' : 'f' },
			cell_5 	 : {'label' : 'Дороги с усоверш. покрытием всего (км./т.м<sup>2</sup>.) ', 'type' : 'fs' },
			cell_6 	 : {'label' : 'Дороги с усоверш. покрытием муниципальных (км./т.м<sup>2</sup>.) ', 'type' : 'fs' },
			cell_7 	 : {'label' : 'Дороги с гравийным покрытием всего (км./т.м<sup>2</sup>.) ', 'type' : 'fs' },
			cell_8 	 : {'label' : 'Дороги с гравийным покрытием муниципальных (км./т.м<sup>2</sup>.)', 'type' : 'fs' },
			cell_9 	 : {'label' : 'Мосты ж/б (ед.) ', 'type' : 'f' },
			cell_10 	 : {'label' : 'Мосты металл (ед.) ', 'type' : 'f' },
			cell_11 	 : {'label' : 'Мосты дерев. (ед.) ', 'type' : 'f' },
			cell_12 	 : {'label' : 'Специальная техника для механич уборки (ед.) ', 'type' : 'f' },
			cell_13 	 : {'label' : 'Специальная техника для механич уборки (марка)', 'type' : 't' },
			cell_14 	 : {'label' : 'Специальная техника водовозки (ед.)', 'type' : 'f' },
			cell_15 	 : {'label' : 'Специальная техника водовозки (марка) ', 'type' : 't' }
	};
	var pmo7Head = {
			1 	: { 'label' : 		'муниципальный', 'color' : '#ece790' }, 
			2 	: { 'label' : 		'государственный', 'color' : '#ece790' }, 
			3 	: { 'label' : 		'частный' , 'color' : '#ece790'}, 
			4 	: { 'label' : 		'здравоохране ния' , 'color' : '#c2ecff'}, 
			5 	: { 'label' : 		'образования' , 'color' : '#c2ecff'}, 
			6 	: { 'label' : 		'социального развития' , 'color' : '#c2ecff'}, 
			7 	: { 'label' : 		'физической культуры и спорта' , 'color' : '#c2ecff'}, 
			8 	: { 'label' : 		'культуры и архивов' , 'color' : '#c2ecff'}, 
			9 	: { 'label' : 		'Прочие'  , 'color' : '#f7f7f7'} 
	};
	var pmo7Field = {
			cell_1 	 : {'label' : '[Потребность] в приборах учета (теплоснабжение)', 'type' : 'f' },
			cell_2 	 : {'label' : '[Установлено] приборов учета (теплоснабжение)', 'type' : 'f' },
			cell_3 	 : {'label' : '[Потребность] в приборах учета (ГВС)', 'type' : 'f' },
			cell_4 	 : {'label' : '[Установлено] приборов учета (ГВС)', 'type' : 'f' },
			cell_5 	 : {'label' : '[Потребность] в приборах учета (ХВС)', 'type' : 'f' },
			cell_6 	 : {'label' : '[Установлено] приборов учета (ХВС)', 'type' : 'f' },
			cell_7 	 : {'label' : '[Потребность] в приборах учета (Электроснабжения)', 'type' : 'f' },
			cell_8 	 : {'label' : '[Установлено] приборов учета (Электроснабжения)', 'type' : 'f' },
			cell_9 	 : {'label' : '[Потребность] в приборах учета (Газоснабжения)', 'type' : 'f' },
			cell_10 	 : {'label' : '[Установлено] приборов учета (Газоснабжения)', 'type' : 'f' }
		};	
	var pmo6Field = {
			cell_1 	 : {'label' : 'Название объекта (расположение)', 'type' : 'ta' },
			cell_2 	 : {'label' : 'Единица измерения', 'type' : 't' },
			cell_3 	 : {'label' : 'Наименование объекта ', 'type' : 'ta' },
			cell_4 	 : {'label' : 'Площадь земельного участка (м<sup>2</sup>)', 'type' : 'f' },
			cell_5 	 : {'label' : 'Характеристика объекта (мощность, кол-во ед., м и т.д.)', 'type' : 'f' },
			cell_6 	 : {'label' : 'Ведомственная принадлежность (бывший владелец, бесхозяйные) ', 'type' : 'ta' },
			cell_7 	 : {'label' : 'С какого времени бесхозяйные', 'type' : 't' },
			cell_8 	 : {'label' : 'Техническое состояние, год ввода в эксплуатацию', 'type' : 'ta' },
			cell_9 	 : {'label' : 'Целесообразность восстановления, объем средств на восстановление (млн.руб.)', 'type' : 'f' },
			cell_10  : {'label' : 'Принимаемые меры ', 'type' : 'ta' }
		};
	var pmo5Field = {
			cell_1 	 : {'label' : 'Объекты электроснабжения всего (км.) ' },
			cell_2 	 : {'label' : 'Объекты электроснабжения ветхие (км.) ' },
			cell_3 	 : {'label' : 'Протяженность электрических сетей воздушные лини всего (км.) ' },
			cell_4 	 : {'label' : 'Протяженность электрических сетей воздушные лини 0.4 кВт. (км.) ' },
			cell_5 	 : {'label' : 'Протяженность электрических сетей воздушные лини 6 кВт. (км.) ' },
			cell_6 	 : {'label' : 'Протяженность электрических сетей воздушные лини 10 кВт. (км.) ' },
			cell_7 	 : {'label' : 'Протяженность электрических сетей воздушные лини 35 кВт. (км.) ' },
			cell_8 	 : {'label' : 'Протяженность электрических сетей воздушные лини 110 кВт. (км.) ' },
			cell_9 	 : {'label' : 'Протяженность электрических сетей кабельные линии всего (км.) ' },
			cell_10 	 : {'label' : 'Протяженность электрических сетей кабельные линии 0.4 кВт. (км.) ' },
			cell_11 	 : {'label' : 'Протяженность электрических сетей кабельные линии 6 кВт. (км.) ' },
			cell_12 	 : {'label' : 'Протяженность электрических сетей кабельные линии 10 кВт. (км.) ' },
			cell_13 	 : {'label' : 'Средний уровень износа (%) ' },
			cell_14 	 : {'label' : 'Трансформаторные подстанции (ед.) ' },
			cell_15 	 : {'label' : 'Дизельные станции (ед.) ' },
			cell_16 	 : {'label' : 'Дизельные станции (кВт.) ' }
		};
			
			
	var pmo4Head = {
			1 	: {'title' : 'Муниципальные магистральные в подземном исполнении', 'label' : 		'Мун. магистр. в подземном исполнении' }, 
			2 	: {'title' : 'Муниципальные магистральные надземном исполнении', 'label' : 			'Мун. магистр. надземном исполнении' }, 
			3 	: {'title' : 'Муниципальные магистральные средний уровень износа в %', 'label' : 	'Мун. магистр. средний уровень износа в %' }, 
			4 	: {'title' : 'Муниципальные распределительные в подземном исполнении', 'label' : 	'Мун. распред. в подземном исполнении' }, 
			5 	: {'title' : 'Муниципальные распределительные надземном исполнении', 'label' : 		'Мун. распред. надземном исполнении' }, 
			6 	: {'title' : 'Муниципальные распределительные средний уровень износа в %', 'label' :'Мун. распред. средний уровень износа в %' }, 
			7 	: {'title' : 'Ведомственные магистральные в подземном исполнении', 'label' : 		'Ведомств. магистр. в подземном исполнении' }, 
			8 	: {'title' : 'Ведомственные магистральные надземном исполнении', 'label' : 			'Ведомств. магистр. надземном исполнении' }, 
			9 	: {'title' : 'Ведомственные магистральные средний уровень износа в %', 'label' : 	'Ведомств. магистр. средний уровень износа в %' }, 
			10 	: {'title' : 'Ведомственные распределительные в подземном исполнении', 'label' : 	'Ведомств. распред. в подземном исполнении' }, 
			11 	: {'title' : 'Ведомственные распределительные надземном исполнении', 'label' : 		'Ведомств. распред. надземном исполнении' }, 
			12 	: {'title' : 'Ведомственные распределительные средний уровень износа в %', 'label' :'Ведомств. распред. средний уровень износа в %' }
			};		
	var pmo4Field = {
			cell_1 	 : {'label' : 'Водозаборы открытого типа (ед.)' },
			cell_2 	 : {'label' : 'Водозаборы открытого типа (тм3./сут.)' },
			cell_3 	 : {'label' : 'Водозаборы подземные типа (ед.)' },
			cell_4 	 : {'label' : 'Водозаборы подземные типа (тм3./сут.)' },
			cell_5 	 : {'label' : 'ВНС (ед.)' },
			cell_6 	 : {'label' : 'ВНС (тм3./сут.)' },
			cell_7 	 : {'label' : 'Скважины (ед.)' }, 		
			cell_8 	 : {'label' : 'Водоочистка (ед.)' }, 	
			cell_9 	 : {'label' : 'Водоочистка (тм3./сут.)' }, 	
			cell_10  : {'label' : 'Водопроводные сети всего (км.)' }, 		
			cell_11  : {'label' : 'Водопроводные сети ветхие (км.)' }, 	
			cell_12  : {'label' : 'Водопроводные сети диаметр до 100мм (км.)' }, 	
			cell_13  : {'label' : 'Водопроводные сети диаметр от 100 до 300 мм (км.)' }, 	
			cell_14  : {'label' : 'Водопроводные сети диаметр от 300 до 600 мм (км.)' },
			cell_15  : {'label' : 'Водопроводные сети диаметр более 600 мм (км.)' }, 
			cell_16  : {'label' : 'Канализационные сети всего (км.)' }, 
			cell_17  : {'label' : 'Канализационные сети ветхие (км.)' }, 
			cell_18  : {'label' : 'КОС (ед.) ' },
			cell_19  : {'label' : 'КНС (ед.)' }, 	
			cell_20  : {'label' : 'Выгреба, септики (ед.)' } 
			};
		
	var pmo3Head = {
			1 : {'label' : 'Муниципальные магистральные в подземном исполнении' },
			2 : {'label' : 'Муниципальные магистральные надземном исполнении' },
			3 : {'label' : 'Муниципальные магистральные средний уровень износа в %' },
			4 : {'label' : 'Муниципальные распределительные в подземном исполнении' },
			5 : {'label' : 'Муниципальные распределительные надземном исполнении' },
			6 : {'label' : 'Муниципальные распределительные средний уровень износа в %' },
			7 : {'label' : 'Ведомственные магистральные в подземном исполнении' },
			8 : {'label' : 'Ведомственные магистральные надземном исполнении' },
			9 : {'label' : 'Ведомственные магистральные средний уровень износа в %' },
			10 : {'label' : 'Ведомственные распределительные в подземном исполнении' },
			11 : {'label' : 'Ведомственные распределительные надземном исполнении' },
			12 : {'label' : 'Ведомственные распределительные средний уровень износа в %' }
			};
	var pmo3Field = {
			cell_1 : {'label' : 'всего (км.)' },
			cell_2 : {'label' : 'всего, в.т.ч. ветхие (км.) ' },
			cell_3 : {'label' : 'диаметр до 200мм (км.) ' },
			cell_4 : {'label' : 'диаметр от 200мм до 400мм (км.) ' },
			cell_5 : {'label' : 'диаметр от 400мм до 600мм (км.) ' },
			cell_6 : {'label' : 'диаметр более 600мм (км.)' }
			};		
			
	var pmo1Field = {
			cell_1 : {'label' : 'численность населения (тыс.чел.)' },
			cell_2 : {'label' : 'Всего зданий жилого назначения кол/во домов (ед.)' },
			cell_3 : {'label' : 'Всего зданий жилого назначения общая площадь жилых и нежилых (тыс.кв.м)' },
			cell_4 : {'label' : 'Многоквартирные дома кол/во домов (ед.) ' },
			cell_5 : {'label' : 'Многоквартирные дома общая площадь жилых и нежилых (тыс.кв.м) ' },
			cell_6 : {'label' : 'Блокированной застройки кол/во домов (ед.) ' },
			cell_7 : {'label' : 'Блокированной застройки общая площадь жилых и нежилых (тыс.кв.м) ' },
			cell_8 : {'label' : 'Жилые дома кол/во домов (ед.) ' },
			cell_9 : {'label' : 'Жилые дома общая площадь жилых и нежилых (тыс.кв.м) ' },
			cell_10 : {'label' : 'Смешанной собственности кол/во домов (ед.) ' },
			cell_11 : {'label' : 'Смешанной собственности общая площадь жилых и нежилых (тыс.кв.м) ' },
			cell_12 : {'label' : 'Муниципальный (полностью) кол/во домов (ед.) ' },
			cell_13 : {'label' : 'Муниципальный (полностью) общая площадь жилых и нежилых (тыс.кв.м) ' },
			cell_14 : {'label' : 'Муниципальный (полностью) износ от 31 до 65% (ед.) ' },
			cell_15 : {'label' : 'Муниципальный (полностью) износ от 31 до 65% (тыс.кв.м) ' },
			cell_16 : {'label' : 'Муниципальный (полностью) ветхий жилой фонд (ед.) ' },
			cell_17 : {'label' : 'Муниципальный (полностью) ветхий жилой фонд (тыс.кв.м) ' },
			cell_18 : {'label' : 'Ведомственный кол/во домов (ед.) ' },
			cell_19 : {'label' : 'Ведомственный общая площадь жилых и нежилых (тыс.кв.м) ' },
			cell_20 : {'label' : 'Частный кол/во домов (ед.) ' },
			cell_21 : {'label' : 'Частный общая площадь жилых и нежилых (тыс.кв.м) ' },
			};		

	var zhkh24Field = {
			 1 	 : {'label' :  'Выделено на ликвидацию последствий аварий (млн руб)' },
			 2 	 : {'label' :  'Израсходовано на ликвидацию последствий аварий (млн руб)' },
			 3 	 : {'label' :  'Выделено на приобретение МТР (млн руб)' },
			 4 	 : {'label' :  'Израсходовано на приобретение МТР (млн руб)' },
			 5 	 : {'label' :  'Арматура осветительная (шт)' },
			 6 	 : {'label' :  'Арматура стальная трубопроводная (шт)' },
			 7 	 : {'label' :  'Асбест (м3)' },
			 8 	 : {'label' :  'Гвозди проволочные (т)' },
			 9 	 : {'label' :  'Дымососы (шт)' },
			 10 	 : {'label' :  'Задвижки и затворы стальные (шт)' },
			 11 	 : {'label' :  'Затворы и задвижки из серого чугуна (шт)' },
			 12 	 : {'label' :  'Кабель силовой (типа СРГ, ВРГ, НРГ) (км)' },
			 13 	 : {'label' :  'Кирпич (тыс ед)' },
			 14 	 : {'label' :  'Кислород технический (м3)' },
			 15 	 : {'label' :  'Компрессоры воздушные (шт)' },
			 16 	 : {'label' :  'Котлы водогрейные (шт)' },
			 17 	 : {'label' :  'Краски строительные (т)' },
			 18 	 : {'label' :  'Кровельные материалы, в том числе: рубероид, шифер и т. д (тыс м2)' },
			 19 	 : {'label' :  'Лен (кг)' },
			 20 	 : {'label' :  'Лесоматериалы в пересчете на круглый лес, в том числе: пиломатериалы, фанера клееная, древесно-стружечные плиты и т.д (м3)' },
			 21 	 : {'label' :  'Листы асбестоцементные (шифер) (тыс шт)' },
			 22 	 : {'label' :  'Мастика для герметизации стыков панелей (т)' },
			 23 	 : {'label' :  'Насосы центробежные, в том числе:  насосы погружные (шт)' },
			 24 	 : {'label' :  'Нефтебитум (т)' },
			 25 	 : {'label' :  'Опоры деревянные (шт)' },
			 26 	 : {'label' :  'Опоры железобетонные (шт)' },
			 27 	 : {'label' :  'Провод неизолированный для воздушных линий (т)' },
			 28 	 : {'label' :  'Провода установочные (тыс пог м)' },
			 29 	 : {'label' :  'Проволока обыкновенного качества (т)' },
			 30 	 : {'label' :  'Прокат черных металлов, в том числе: сталь листовая оцинкованная, освинцованная и луженая, уголок,швеллер и др. (т)' },
			 31 	 : {'label' :  'Радиаторы и конвекторы отопительные (шт)' },
			 32 	 : {'label' :  'Резервные стационарные и передвижные ДЭС (шт)' },
			 33 	 : {'label' :  'Сварочное оборудование (шт)' },
			 34 	 : {'label' :  'Стекло строительное (тыс м2)' },
			 35 	 : {'label' :  'Тепло- и изоляционные материалы (м3)' },
			 36 	 : {'label' :  'Трансформаторы (шт)' },
			 37 	 : {'label' :  'Трубы и детали трубопроводов из термопластов (т)' },
			 38 	 : {'label' :  'Трубы катаные и тянутые общего назначения (т)' },
			 39 	 : {'label' :  'Трубы сварные водогазопроводные (газовые) (т)' },
			 40 	 : {'label' :  'Трубы чугунные канализационные и фасонные части к ним (т)' },
			 41 	 : {'label' :  'Цемент (т)' },
			 42 	 : {'label' :  'Электродвигатели (шт)' },
			 43 	 : {'label' :  'Электроды сварочные (т)' },
			 44 	 : {'label' :  'Электрокалориферы (шт)' },
		};	
	
	var tPr2Head = {
			1 : {'label' : 'Уголь, т' },
			3 : {'label' : 'Мазут, т' },
			4 : {'label' : 'Нефть, т' },
			5 : {'label' : 'Газоконденсат, т' },
			6 : {'label' : 'ПБФ, т ' },
			7 : {'label' : 'Дрова, т' },
			8 : {'label' : 'Щепа, т' },
			9 : {'label' : 'Газ, тыс.куб.м' }		
		};
	var tPr2Field = {
			cell_3 : {'label' : 'Годовая потребность в топливе на отоп.сез. Всего' },
			cell_4 : {'label' : 'Годовая потребность в топливе на отоп.сез. На муниципальных теплоисточниках' },
			cell_5 : {'label' : 'сентябрь, всего' },
			cell_6 : {'label' : 'сентябрь, мун. кот.' },
			cell_7 : {'label' : 'октябрь, всего' },
			cell_8 : {'label' : 'октябрь, мун. кот.' },
			cell_9 : {'label' : 'ноябрь, всего ' },
			cell_10 : {'label' : 'ноябрь, мун. кот. ' },
			cell_11 : {'label' : 'декабрь, всего ' },
			cell_12 : {'label' : 'декабрь, мун. кот. ' },
			cell_13 : {'label' : 'январь, всего ' },
			cell_14 : {'label' : 'январь, мун. кот. ' },
			cell_15 : {'label' : 'февраль, всего' },
			cell_16 : {'label' : 'февраль, мун. кот.' },
			cell_17 : {'label' : 'март, всего ' },
			cell_18 : {'label' : 'март, мун. кот. ' },
			cell_19 : {'label' : 'апрель, всего ' },
			cell_20 : {'label' : 'апрель, мун. кот.' },
			cell_21 : {'label' : 'май, всего ' },
			cell_22 : {'label' : 'май, мун. кот. ' },
			cell_23 : {'label' : 'Расход за отопитель-ный сезон, всего (т)' },
			cell_24 : {'label' : 'Расход за отопитель-ный сезон, мун.котельных (т) ' },
			cell_25 : {'label' : 'Остаток на конец отопи-тельного сезона всего ' },
			cell_26 : {'label' : 'Остаток на конец отопи-тельного сезона мун. кот.' }
		};	
	var zhkh2Head = {
			1 : {'label' : 'Количество источников теплоснабжения, (ед.)' },
			2 : {'label' : 'Количество отапливаемых жилых зданий, (ед.)' },
			3 : {'label' : 'Объем отапливаемых жилых зданий, (м<sup>3</sup>)' },
			4 : {'label' : 'Кол. отапливаемых зданий соц.назначения, (ед.)' },
			5 : {'label' : 'Объем отапливаемых зданий соц назначения, (м<sup>3</sup>)' },
			6 : {'label' : 'Средняя продолжительность отоп.периода, (сут.)' },
			7 : {'label' : 'Количество источников теплоснабжения, имеющих второй ввод энергоснабжения (ед)' },
			8 : {'label' : 'Количество котлов, (ед)' },
			9 : {'label' : 'Мощность котельных установок, (Гкал/ч)' },
			10 : {'label' : 'Расход топлива по норме, (кг/Гкал/ч)' },
			11 : {'label' : 'Расход топлива фактически, (кг/Гкал/ч)' },
			12 : {'label' : 'Потребность топлива на весь отопительный период' },
			13 : {'label' : 'Сформированные запасы на начало отопительного периода: для ЖКХ' },
			14 : {'label' : 'Сформированные запасы на начало отопительного периода: для населения' },
			15 : {'label' : 'Сформированные запасы на начало отопительного периода: для ведомственных котельных' },
			16 : {'label' : 'Объем складов: всего' },
			17 : {'label' : 'Объем складов: по ведомственным котельным' },
			18 : {'label' : 'Дефицит складских помещений, для формирования минимального запаса топлива' },
		};
	var zhkh2Field = {
			cell_1 : {'label' : 'на угле всего ' },
			cell_2 : {'label' : 'на угле в т.ч. резерв ' },
			cell_3 : {'label' : 'на дровах всего ' },
			cell_4 : {'label' : 'на дровах в т.ч. резерв ' },
			cell_5 : {'label' : 'на мазуте всего ' },
			cell_6 : {'label' : 'на мазуте в т.ч. резерв' },
			cell_7 : {'label' : 'на газоконденсате всего ' },
			cell_8 : {'label' : 'на газоконденсате в т.ч. резерв ' },
			cell_9 : {'label' : 'эл. котельные всего' },
			cell_10 : {'label' : 'эл. котельные в т.ч. резерв ' },
			cell_11 : {'label' : 'другие виды топлива всего ' },
			cell_12 : {'label' : 'другие виды топлива в т.ч. резерв ' }
		};
	var zhkh3Field = {
			cell_1 : {'label' : '[уголь] всего (т.)', 'type' : 'i'},
			cell_2 : {'label' : '[уголь] основное (т.)'},
			cell_3 : {'label' : '[уголь] резервное (т.)'},
			cell_4 : {'label' : '[дрова] всего (м<sup>3</sup>.)'},
			cell_5 : {'label' : '[дрова] основное (м<sup>3</sup>.) '},
			cell_6 : {'label' : '[дрова] резервное (м<sup>3</sup>.) '},
			cell_7 : {'label' : '[щепа] всего (м<sup>3</sup>.) '},
			cell_8 : {'label' : '[щепа] основное (м<sup>3</sup>.)'},
			cell_9 : {'label' : '[щепа] резервное (м<sup>3</sup>.)'},
			cell_10 : {'label' : '[мазут] всего (т.)'},
			cell_11 : {'label' : '[мазут] основное (т.) '},
			cell_12 : {'label' : '[мазут] резервное (т.) '},
			cell_13 : {'label' : '[газ] всего (м<sup>3</sup>.) '},
			cell_14 : {'label' : '[газ] основное (м<sup>3</sup>.) '},
			cell_15 : {'label' : '[газ] резервное (м<sup>3</sup>.) '},
			cell_16 : {'label' : '[газоконденсат] всего (т.)'},
			cell_17 : {'label' : '[газоконденсат] основное (т.) '},
			cell_18 : {'label' : '[газоконденсат] резервное (т.) '},
			cell_19 : {'label' : '[электроэнергия] всего (кВт./ч.) '},
			cell_20 : {'label' : '[электроэнергия] основное (кВт./ч.) '},
			cell_21 : {'label' : '[электроэнергия] резервное (кВт./ч.) '}
		};
	var sfoField_5 = [];
		sfoField_5['cell_62'] = "Топливо Уголь, отопительный сезон (тыс.тонн)";
		sfoField_5['cell_63'] = "Топливо Уголь, нормативный запас (тыс.тонн) ";
		sfoField_5['cell_64'] = "Топливо Уголь, запасено (тыс.тонн) ";
		sfoField_5['cell_65'] = "Топливо Уголь, к общей потребности (%) ";
		sfoField_5['cell_66'] = "Топливо Уголь, к нормативному запасу (%) ";
		sfoField_5['cell_67'] = "Топливо Жидкое топливо, отопительный сезон (тыс.тонн) 	";
		sfoField_5['cell_68'] = "Топливо Жидкое топливо, нормативный запас (тыс.тонн)";
		sfoField_5['cell_69'] = "Топливо Жидкое топливо, запасено (тыс.тонн) ";
		sfoField_5['cell_70'] = "Топливо Жидкое топливо, к общей потребности (%) ";
		sfoField_5['cell_71'] = "Топливо Жидкое топливо, к нормативному запасу (%) ";
	var sfoField_3 = [];
		sfoField_3['cell_42'] = "Тепловые сети, всего (км.) ";
		sfoField_3['cell_43'] = "Тепловые сети, из них ветхие (км.) ";
		sfoField_3['cell_44'] = "Тепловые сети План подготовки (км.) ";
		sfoField_3['cell_45'] = "Тепловые сети План подготовки, кап.ремонт и замена трубопроводов (км.) ";
		sfoField_3['cell_46'] = "Тепловые сети Фактическая подготовка (км.) ";
		sfoField_3['cell_47'] = "Тепловые сети Фактическая подготовка, кап.ремонт и замена трубопроводов (км.) ";
		sfoField_3['cell_48'] = "Тепловые сети % готовности по графику (%) ";
		sfoField_3['cell_49'] = "Тепловые сети % готовности по факту (%) ";
		sfoField_3['cell_50'] = "Тепловые сети % готовности по графику (замена трубопров.)";
		sfoField_3['cell_51'] = "Тепловые сети % готовности по факту (замена трубопров.)";
		sfoField_3['cell_52'] = "Водопроводные, всего (км.) ";
		sfoField_3['cell_53'] = "Водопроводные, из них ветхие (км.) ";
		sfoField_3['cell_54'] = "Водопроводные План подготовки (км.) ";
		sfoField_3['cell_55'] = "Водопроводные План подготовки, кап.ремонт и замена трубопроводов (км.) ";
		sfoField_3['cell_56'] = "Водопроводные Фактическая подготовка (км.) ";
		sfoField_3['cell_57'] = "Водопроводные Фактическая подготовка, кап.ремонт и замена трубопроводов (км.)  ";
		sfoField_3['cell_58'] = "Водопроводные % готовности по графику (%) ";
		sfoField_3['cell_59'] = "Водопроводные % готовности по факту (%) ";
		sfoField_3['cell_60'] = "Водопроводные % готовности по графику (замена трубопров.)";
		sfoField_3['cell_61'] = "Водопроводные % готовности по факту (замена трубопров.) ";
	var sfoField_4 = [];
		sfoField_4['cell_26'] = "План (млн.руб.)";
		sfoField_4['cell_27'] = "План в т.ч. топливо (млн.руб.)";
		sfoField_4['cell_28'] = "План областного бюджета, всего (млн.руб.)";
		sfoField_4['cell_29'] = "План областного бюджета, в т.ч.топливо (млн.руб.)";
		sfoField_4['cell_30'] = "План местного бюджета, всего (млн.руб.)";
		sfoField_4['cell_31'] = "План местного бюджета, в т.ч.топливо (млн.руб.)";
		sfoField_4['cell_32'] = "План предприятий ЖКХ, всего (млн.руб.) ";
		sfoField_4['cell_33'] = "План предприятий ЖКХ, в т.ч.топливо (млн.руб.)";
		sfoField_4['cell_34'] = "Фактическое финасирование выполненных объемов работ на объектах ЖКХ (млн.руб.)";
		sfoField_4['cell_35'] = "Фактическое финасирование выполненных объемов работ на объектах ЖКХ, в т.ч.топливо (млн.руб.) ";
		sfoField_4['cell_36'] = "Фактическое финасирование выполненных объемов работ на объектах ЖКХ, областного бюджета, всего (млн.руб.) ";
		sfoField_4['cell_37'] = "Фактическое финасирование выполненных объемов работ на объектах ЖКХ, областного бюджета, в (млн.руб.) ";
		sfoField_4['cell_38'] = "Фактическое финасирование выполненных объемов работ на объектах ЖКХ, местного бюджета, всего (млн.руб.) ";
		sfoField_4['cell_39'] = "Фактическое финасирование выполненных объемов работ на объектах ЖКХ, местного бюджета, в (млн.руб.) 	 ";
		sfoField_4['cell_40'] = "Фактическое финасирование выполненных объемов работ на объектах ЖКХ, предприятий ЖКХ, всего (млн.руб.) ";
		sfoField_4['cell_41'] = "Фактическое финасирование выполненных объемов работ на объектах ЖКХ, предприятий ЖКХ, в т.ч: топ-во (млн.руб.) ";
	var sfoField_2 = [];
		sfoField_2['cell_17'] = "Котельные, всего (ед.)";
		sfoField_2['cell_18'] = "Котельные План подготовки (ед.)";
		sfoField_2['cell_19'] = "Котельные План подготовки, ремонт и реконструкция (ед.)";
		sfoField_2['cell_20'] = "Котельные Фактическая подготовка, % готовности (ед.)";
		sfoField_2['cell_21'] = "Котельные Фактическая подготовка, % готовности, ремонт и реконструкция, всего (%)";
		sfoField_2['cell_22'] = "Котельные Фактическая подготовка, % готовности, ремонт и реконструкция, по графику (%) ";
		sfoField_2['cell_23'] = "Котельные Фактическая подготовка, % готовности, ремонт и реконструкция, по факту (%)";
		sfoField_2['cell_24'] = "Котельные Фактическая подготовка, % готовности, ремонт и реконструкция, по графику (%) ";
		sfoField_2['cell_25'] = "Котельные Фактическая подготовка, % готовности, ремонт и реконструкция, по факту (%)";
	var sfoField_1 ={};
		sfoField_1['cell_3'] = "Жилой фонд, всего (ед.)";
		sfoField_1['cell_4'] = "Жилой фонд, всего (тыс.кв.м.)";
		sfoField_1['cell_5'] = "Жилой фонд План подготовки, всего (ед.)";
		sfoField_1['cell_6'] = "Жилой фонд План подготовки, всего (тыс.кв.м.)";
		sfoField_1['cell_7'] = "Жилой фонд План подготовки, в т.ч:кап.ремонт (ед.)";
		sfoField_1['cell_8'] = "Жилой фонд План подготовки, в т.ч:кап.ремонт (тыс.кв.м.)";
		sfoField_1['cell_9'] = "Жилой фонд Фактическая подготовка, всего ед";
		sfoField_1['cell_10'] = "Жилой фонд Фактическая подготовка, всего (тыс.кв.м.)";
		sfoField_1['cell_11'] = "Жилой фонд Фактическая подготовка, в т.ч:кап.ремонт и реконтр. (ед.)";
		sfoField_1['cell_12'] = "Жилой фонд Фактическая подготовка, в т.ч:кап.ремонт и реконтр. (тыс.кв.м.) ";
		sfoField_1['cell_13'] = "Жилой фонд % готовности, всего по графику (тыс.кв.м.) ";
		sfoField_1['cell_14'] = "Жилой фонд % готовности, всего по факту (тыс.кв.м.)";
		sfoField_1['cell_15'] = "Жилой фонд % готовности, в т.ч. кап.ремонт по графику (тыс.кв.м.)";
		sfoField_1['cell_16'] = "Жилой фонд % готовности, в т.ч. кап.ремонт по факту (тыс.кв.м.)";

	var zhkh1Field = [];
		zhkh1Field['cell_1'] 	= 	"Жилищный фонд всего (тыс.ед.)";
		zhkh1Field['cell_2'] 	= 	"Жилищный фонд всего (тыс.м2.)";
		zhkh1Field['cell_3'] 	= 	"Жилищный фонд муниципальный (тыс.ед.)";
		zhkh1Field['cell_4'] 	= 	"Жилищный фонд муниципальный (тыс.м2.)";
		zhkh1Field['cell_5'] 	= 	"Жилищный фонд государственный (тыс.ед.)";
		zhkh1Field['cell_6'] 	= 	"Жилищный фонд государственный (тыс.м2.)";
		zhkh1Field['cell_7'] 	= 	"Жилищный фонд частный (тыс.ед.)";
		zhkh1Field['cell_8'] 	= 	"Жилищный фонд частный (тыс.м2.)";
		zhkh1Field['cell_9'] 	= 	"Котельные всего (ед.)";
		zhkh1Field['cell_10'] 	= 	"Котельные всего (Гкал.)";
		zhkh1Field['cell_11'] 	= 	"Котельные муниципальный (ед.)";
		zhkh1Field['cell_12'] 	= 	"Котельные муниципальный (Гкал.)";
		zhkh1Field['cell_13'] 	= 	"Тепловые сети (в 2-х трубном исчислении) всего (км.)";
		zhkh1Field['cell_14'] 	= 	"Тепловые сети (в 2-х трубном исчислении) муниципальный (км.)";
		zhkh1Field['cell_15'] 	= 	"Ветхие тепловые сети (в 2-х трубном исчислении) всего (км.)";
		zhkh1Field['cell_16'] 	= 	"Ветхие сети (в 2-х трубном исчислении) муниципальный (км.)";
		zhkh1Field['cell_17'] 	= 	"Тепловые насосные станции всего (ед.)";
		zhkh1Field['cell_18'] 	= 	"Тепловые насосные станции муниципальный (ед.)";
		zhkh1Field['cell_19'] 	= 	"ЦТП всего (ед.)";
		zhkh1Field['cell_20'] 	= 	"ЦТП муниципальный (ед.)";
		zhkh1Field['cell_21'] 	= 	"Водозаборы всего (ед.)";
		zhkh1Field['cell_22'] 	= 	"Водозаборы муниципальный (ед.)";
		zhkh1Field['cell_23'] 	= 	"Насосные станции водопровода всего (ед.)";
		zhkh1Field['cell_24'] 	= 	"Насосные станции водопровода муниципальный (ед.)";
		zhkh1Field['cell_25'] 	= 	"Очистные сооружения водопровода всего (ед.)";
		zhkh1Field['cell_26'] 	= 	"Очистные сооружения водопровода пропуск. способ. (т.м<sup>3</sup>/сут.)";
		zhkh1Field['cell_27'] 	= 	"Очистные сооружения водопровода муниципальный (км.)";
		zhkh1Field['cell_28'] 	= 	"Очистные сооружения водопровода пропуск. способ. муниципальный (т.м<sup>3</sup>/сут.)";
		zhkh1Field['cell_29'] 	= 	"Водопроводные сети всего (км.)";
		zhkh1Field['cell_30'] 	= 	"Водопроводные сети муниципальный (км.)";
		zhkh1Field['cell_31'] 	= 	"Ветхие водопроводные сети всего (км.)";
		zhkh1Field['cell_32'] 	= 	"Ветхие водопроводные сети муниципальный (км.)";
		zhkh1Field['cell_33'] 	= 	"Канализационные насосные станции всего (ед.)";
		zhkh1Field['cell_34'] 	= 	"Канализационные насосные станции муниципальный (ед.) ";
		zhkh1Field['cell_35'] 	= 	"Очистные сооружения канализации всего (ед.) ";
		zhkh1Field['cell_36'] 	= 	"Очистные сооружения канализации пропуск. способ. (т.м<sup>3</sup>/сут.) ";
		zhkh1Field['cell_37'] 	= 	"Очистные сооружения канализации муниципальный (км.)";
		zhkh1Field['cell_38'] 	= 	"Очистные сооружения канализации пропуск. способ. муниципальный (т.м<sup>3</sup>/сут.) ";
		zhkh1Field['cell_39'] 	= 	"Канализационные сети всего (км.)";
		zhkh1Field['cell_40'] 	= 	"Канализационные сети муниципальный (км.)";
		zhkh1Field['cell_41'] 	= 	"Ветхие канализационные сети всего (км.)";
		zhkh1Field['cell_42'] 	= 	"Ветхие канализационные сети муниципальный (км.)";
		zhkh1Field['cell_43'] 	= 	"Электр. сети всего (км.)";
		zhkh1Field['cell_44'] 	= 	"Электр. сети муниципальный (км.)";
		zhkh1Field['cell_45'] 	= 	"Ветхие электр. сети всего (км.)";
		zhkh1Field['cell_46'] 	= 	"Ветхие электр. сети муниципальный (км.)";
		zhkh1Field['cell_47'] 	= 	"Трансформаторные подстанции всего (ед.)";
		zhkh1Field['cell_48'] 	= 	"Трансформаторные подстанции муниципальный (ед.)";
		zhkh1Field['cell_49'] 	= 	"Специальные маш. для мех.уборки всего (ед.)";
		zhkh1Field['cell_50'] 	= 	"Специальные маш. для мех.уборки муниципальный (ед.)";
		zhkh1Field['cell_51'] 	= 	"Улично-дорожная сеть всего (т.м<sup>2</sup>)";
		zhkh1Field['cell_52'] 	= 	"Улично-дорожная сеть муниципальный (т.м<sup>2</sup>) ";
		zhkh1Field['cell_53'] 	= 	"Подг.мостов (тран.пеш. и путепроводов) всего (ед.)";
		zhkh1Field['cell_54'] 	= 	"Подг.мостов (тран.пеш. и путепроводов) муниципальный (ед.)";
		zhkh1Field['cell_55'] 	= 	"Подг.транспортных и пешех. тоннелей всего (ед.)";
		zhkh1Field['cell_56'] 	= 	"Подг.транспортных и пешех. тоннелей муниципальный (ед.)";
		zhkh1Field['cell_57'] 	= 	"Подг. гидро-технич.сооружений всего (ед.)";
		zhkh1Field['cell_58'] 	= 	"Подг. гидро-технич.сооружений муниципальный (ед.)";
		zhkh1Field['cell_59'] 	= 	"Газопроводы (км.)";
		zhkh1Field['cell_60'] 	= 	"Создание запасов топлива уголь (тн.)";
		zhkh1Field['cell_61'] 	= 	"Создание запасов топлива др. тверд. топл. (тн.)";
		zhkh1Field['cell_62'] 	= 	"Создание запасов топлива жид. топл. (тн.)";
		zhkh1Field['cell_63'] 	= 	"Создание запасов топлива газ (т.м<sup>3</sup>)";
		zhkh1Field['cell_64'] 	= 	"Нетрадиц. источники эл.энергии всего (кВт.)";
		zhkh1Field['cell_65'] 	= 	"Нетрадиц. источники эл.энергии приливные (кВт.)";
		zhkh1Field['cell_66'] 	= 	"Нетрадиц. источники эл.энергии солнечные (кВт.)";
		zhkh1Field['cell_67'] 	= 	"Нетрадиц. источники эл.энергии ветровые (кВт.)";
		zhkh1Field['cell_68'] 	= 	"Нетрадиц. источники эл.энергии термальные (кВт.)";
		zhkh1Field['cell_69'] 	= 	"Финан. средства субъекта РФ, выделяемые для подготовки ЖКХ МО к зиме всего (млн.руб.)";
		zhkh1Field['cell_70'] 	= 	"Финан. средства субъекта РФ, выделяемые для подготовки ЖКХ МО к зиме топливо (млн.руб.)";
		zhkh1Field['cell_71'] 	= 	"Финан. средства субъекта РФ, выделяемые для подготовки ЖКХ МО к зиме авар.техн.зап. (млн.руб.)";
		zhkh1Field['cell_72'] 	= 	"Финан. средства субъекта РФ, выделяемые для подготовки ЖКХ МО к зиме стр-во объектов ЖКХ (млн.руб.)";
		zhkh1Field['cell_73'] 	= 	"Финан. средства субъекта РФ, выделяемые для подготовки ЖКХ МО к зиме кап.р. модерн. (млн.руб.)";
		zhkh1Field['cell_74'] 	= 	"Финан. средства муниц.образований и предприятий ЖКХ всего (млн.руб.)";
		zhkh1Field['cell_75'] 	= 	"Финан. средства муниц.образований и предприятий ЖКХ топливо (млн.руб.)";
		zhkh1Field['cell_76'] 	= 	"Финан. средства муниц.образований и предприятий ЖКХ авар.техн.зап. (млн.руб.)";
		zhkh1Field['cell_77'] 	= 	"Финан. средства муниц.образований и предприятий ЖКХ стр-во объектов ЖКХ (млн.руб.)";
		zhkh1Field['cell_78'] 	= 	"Финан. средства муниц.образований и предприятий ЖКХ кап.р. модерн. (млн.руб.)";
		zhkh1Field['cell_79'] 	= 	"в т.ч. финансовые средства предприятий ЖКХ всего (млн.руб.)";
		zhkh1Field['cell_80'] 	= 	"в т.ч. финансовые средства предприятий ЖКХ топливо (млн.руб.)";
		zhkh1Field['cell_81'] 	= 	"в т.ч. финансовые средства предприятий ЖКХ авар.техн.зап. (млн.руб.)";
		zhkh1Field['cell_82'] 	= 	"в т.ч. финансовые средства предприятий ЖКХ стр-во объектов ЖКХ (млн.руб.)";
		zhkh1Field['cell_83'] 	= 	"в т.ч. финансовые средства предприятий ЖКХ кап.р. модерн. (млн.руб.)";
		zhkh1Field['cell_84'] 	= 	"Доп-ные ср-ва из ФБ на подг. к ОЗП (млн.руб.)";
		zhkh1Field['cell_85'] 	= 	"Задолженость пред.ЖКХ за ранее потребленные ТЭР всего (млн.руб.)";
		zhkh1Field['cell_86'] 	= 	"Задолженость пред.ЖКХ за ранее потребленные ТЭР уголь (млн.руб.) ";
		zhkh1Field['cell_87'] 	= 	"Задолженость пред.ЖКХ за ранее потребленные ТЭР жид. топл. (млн.руб.)";
		zhkh1Field['cell_88'] 	= 	"Задолженость пред.ЖКХ за ранее потребленные ТЭР щепа, дрова (млн.руб.) ";
		zhkh1Field['cell_89'] 	= 	"Задолженость пред.ЖКХ за ранее потребленные ТЭР теплоэнергия (млн.руб.) ";
		zhkh1Field['cell_90'] 	= 	"Задолженость пред.ЖКХ за ранее потребленные ТЭР электроэнергия (млн.руб.) ";
		zhkh1Field['cell_91'] 	= 	"Паспорт готовности жилищный фонд (тыс.ед.)";
		zhkh1Field['cell_92'] 	= 	"Паспорт готовности котельные, по всем видам собственности (ед.)";
		zhkh1Field['cell_93'] 	= 	"Паспорт котельные, в том числе ЖКХ муниципальных образований (ед.)";
	var toplPril1Field = [];
		toplPril1Field['cell_3'] 	= 	"Количество [котельных] (всего) шт.";
		toplPril1Field['cell_4'] 	= 	"Потребность в топливе теплоисточников в отопительный сезон [уголь] (всего), тн.";
		toplPril1Field['cell_5'] 	= 	"Потребность в топливе теплоисточников в отопительный сезон [жидкое топливо] (всего), тн.";
		toplPril1Field['cell_6'] 	= 	"Потребность в топливе теплоисточников в отопительный сезон [котельные] (муниц.теплоисточниках), шт.";
		toplPril1Field['cell_7'] 	= 	"Потребность в топливе теплоисточников в отопительный сезон [уголь] (муниц.теплоисточниках), тн.";
		toplPril1Field['cell_8'] 	= 	"Потребность в топливе теплоисточников в отопительный сезон [жидкое топливо] (муниц.теплоисточниках), тн.";
		toplPril1Field['cell_9'] 	= 	"Наличие топлива [уголь] (всего), тн ";
		toplPril1Field['cell_10'] = 	"Наличие топлива [жидкое топливо] (всего), тн.";
		toplPril1Field['cell_11'] = 	"Наличие топлива [уголь] (муниц.теплоисточниках), тн ";
		toplPril1Field['cell_12'] = 	"Наличие топлива [жидкое топливо] (муниц.теплоисточниках), тн.";
		toplPril1Field['cell_13'] = 	"Суточный расход топлива [уголь] (всего), тн ";
		toplPril1Field['cell_14'] = 	"Суточный расход топлива [жидкое топливо] (всего), тн.";
		toplPril1Field['cell_15'] = 	"Суточный расход топлива [уголь] (муниц.теплоисточниках), тн ";
		toplPril1Field['cell_16'] = 	"Суточный расход топлива [жидкое топливо] (муниц.теплоисточниках), тн.";
		toplPril1Field['cell_17'] = 	"Запасы топлива в сутках [уголь] (всего), тн ";
		toplPril1Field['cell_18'] = 	"Запасы топлива в сутках [жидкое топливо] (всего), тн.";
		toplPril1Field['cell_19'] = 	"Запасы топлива в сутках [уголь] (муниц.теплоисточниках), тн ";
		toplPril1Field['cell_20'] = 	"Запасы топлива в сутках [жидкое топливо] (муниц.теплоисточниках), тн.";
		toplPril1Field['cell_21'] = 	"Расход топлива нарастающ.итогом с начала отопит.сезона [уголь] (всего), тн ";
		toplPril1Field['cell_22'] = 	"Расход топлива нарастающ.итогом с начала отопит.сезона [жидкое топливо] (всего), тн.";
		toplPril1Field['cell_23'] = 	"Расход топлива нарастающ.итогом с начала отопит.сезона [уголь] (муниц.теплоисточниках), тн ";
		toplPril1Field['cell_24'] = 	"Расход топлива нарастающ.итогом с начала отопит.сезона [жидкое топливо] (муниц.теплоисточниках), тн.";
		toplPril1Field['cell_25'] = 	"ФИО паредающего информацию";
	//var toplPril1Format['i', 'f', 'f', 'i', 'f' , 'f' , 'f' , 'f' , 'f' , 'f' , 'f' , 'f' , 'f' , 'f' , 'f' , 'f' , 'f' , 'f' , 'f' , 'f' , 'f' , 'f' , 't'  ];	
	this.panelChangedAdm = function(oldP, newP, evnt){
//			if(evnt.originalEvent!=undefined)
		if(oldP!=newP){
			var manual = (evnt.originalEvent!=undefined) ? true : false;
	//		console.log(manual);
			switch(newP){
				case 'formContaner' :{
					doEdit = false;	
					var formEl = {};
					$( "#tabs" ).tabs( "disable", "#messContaner" );
					$( "#tabs" ).tabs( "disable", "#objListContaner" );				
					console.log(cloneMessType);
					console.log(formName);
					var contHeader = '';
					//cloneMessId
					if(formName == 'SFO'){
						formName = 'sfo_' + tIndex;
//						console.log('SFO');
					}
					switch(formName){
						case 'sfo_1':{
							//console.log('toplPril1'); pmo_2
							let headerText = (doEdit) ? 'Правка отчёта за текущий период отчёт СФО Таблица 1 (Жилой фонд)' : 'Новый отчёт СФО Таблица 1 (Жилой фонд)';
							$('#formBox .formHeader').text(headerText);
							$( "#mainForm" ).css({'width':''});
							$( "#mainForm" ).removeClass('zhkh1 zhkh2 zhkh3 zhkh4');
						} break;
						case 'sfo_2':{
							//console.log('toplPril1');
							let headerText = (doEdit) ? 'Правка отчёта за текущий период отчёт СФО Таблица 2 (Котельные)' : 'Новый отчёт СФО Таблица 2 (Котельные)';
							$('#formBox .formHeader').text(headerText);
							$( "#mainForm" ).css({'width':''});
							$( "#mainForm" ).removeClass('zhkh1 zhkh2 zhkh3 zhkh4');
						} break;
						case 'sfo_3':{
							//console.log('toplPril1');
							let headerText = (doEdit) ? 'Правка отчёта за текущий период отчёт СФО Таблица 3 (Сети)' : 'Новый отчёт СФО Таблица 3 (Сети)';
							$('#formBox .formHeader').text(headerText);
							$( "#mainForm" ).css({'width':''});
							$( "#mainForm" ).removeClass('zhkh1 zhkh2 zhkh3 zhkh4');
						} break;
						case 'sfo_4':{
							//console.log('toplPril1');
							let headerText = (doEdit) ? 'Правка отчёта за текущий период отчёт СФО Таблица 4 (Финансовые средства на подготовку к зиме ЖКХ)' : 'Новый отчёт СФО Таблица 4 (Финансовые средства на подготовку к зиме ЖКХ)';
							$('#formBox .formHeader').text(headerText);
							$( "#mainForm" ).css({'width':''});
							$( "#mainForm" ).removeClass('zhkh1 zhkh2 zhkh3 zhkh4');
						} break;
						case 'sfo_5':{
							//console.log('toplPril1');
							let headerText = (doEdit) ? 'Правка отчёта за текущий период отчёт СФО Таблица 5 (Топливо)' : 'Новый отчёт СФО Таблица 5 (Топливо)';
							$('#formBox .formHeader').text(headerText);
							$( "#mainForm" ).css({'width':''});
							$( "#mainForm" ).removeClass('zhkh1 zhkh2 zhkh3 zhkh4');
						} break;
						case 'toplPril1':{
							console.log('toplPril1');
							let headerText = (doEdit) ? 'Правка отчёта за текущий период Топливо. Приложение 1 (наличие)' : 'Новый отчёт Топливо. Приложение 1 (наличие)';
							$('#formBox .formHeader').text(headerText);
							$( "#mainForm" ).css({'width':''});
							$( "#mainForm" ).removeClass('zhkh1 zhkh2 zhkh3 zhkh4');

						} break;
						case 'toplPril2':{
							console.log('toplPril2');
							let headerText = (doEdit) ? 'Правка отчёта за текущий период Топливо. Приложение 2 (расход)' : 'Новый отчёт Топливо. Приложение 2 (расход)';
							$('#formBox .formHeader').text(headerText);
							$( "#mainForm" ).css({'width':'950px'});
							$( "#mainForm" ).removeClass('zhkh1 zhkh2 zhkh3');
							$( "#mainForm" ).addClass('zhkh4');

						} break;
						case 'zhkh1':{							
						};
						case '1zhkh':{
							let headerText = (doEdit) ? 'Правка отчёта за текущий период Форма 1 ЖКХ' : 'Новый отчёт Форма 1 ЖКХ';
							$('#formBox .formHeader').text(headerText);
							$( "#mainForm" ).css({'width':'800px'});
							$( "#mainForm" ).removeClass('zhkh3 zhkh2 zhkh4');
							$( "#mainForm" ).addClass('zhkh1');
						} break;
						case 'zhkh2':{
							let headerText = (doEdit) ? 'Правка отчёта за текущий период Форма 2 ЖКХ' : 'Новый отчёт Форма 2 ЖКХ';
							$('#formBox .formHeader').text(headerText);
//							$('#formBox .formHeader').text('Новый отчёт Форма 2 ЖКХ');
							$( "#mainForm" ).css({'width':'1070px'});
							$( "#mainForm" ).removeClass('zhkh1 zhkh3 zhkh4');
							$( "#mainForm" ).addClass('zhkh2');

						} break;
						case 'zhkh24':{
							let headerText = (doEdit) ? 'Правка отчёта за текущий период Форма 2 ЖКХ Приложение 4' : 'Новый отчёт Форма 2 ЖКХ Приложение 4';
							$('#formBox .formHeader').text(headerText);
//							$('#formBox .formHeader').text('Новый отчёт Форма 2 ЖКХ Приложение 4');
							$( "#mainForm" ).css({'width':''});
							$( "#mainForm" ).removeClass('zhkh2 zhkh3 zhkh4');
							$( "#mainForm" ).addClass('zhkh1');
						} break;
						case 'zhkh3':{
							let headerText = (doEdit) ? 'Правка отчёта за текущий период Форма 3 ЖКХ' : 'Новый отчёт Форма 3 ЖКХ';
							$('#formBox .formHeader').text(headerText);
//							$('#formBox .formHeader').text('Новый отчёт Форма 3 ЖКХ');
							$( "#mainForm" ).css({'width':'1000px'});
							$( "#mainForm" ).removeClass('zhkh1 zhkh2 zhkh4');
							$( "#mainForm" ).addClass('zhkh3');
						} break;
						case 'pmo1':{
						};
						case 'pmo_1':{
							let headerText = 'Паспорт МО. ';
							headerText += (doEdit) ? 'Правка отчёта Характеристика объектов ЖКХ' : 'Новый отчёт Характеристика объектов ЖКХ';
							$('#formBox .formHeader').text(headerText);
//							$('#formBox .formHeader').text('Паспорт МО. Характеристика объектов ЖКХ');
							$( "#mainForm" ).css({'width':'800px'});
							$( "#mainForm" ).removeClass('zhkh1 zhkh2 zhkh3 zhkh4');
							$( "#mainForm" ).addClass('zhkh1');
						} break;
						case 'pmo2':{
							let headerText = 'Паспорт МО. ';
							headerText += (doEdit) ? 'Правка теплоисточника' : 'Новый теплоисточник';
							$('#formBox .formHeader').text(headerText);
							$( "#mainForm" ).css({'width':'600px'});
							$( "#mainForm" ).removeClass('zhkh1 zhkh2 zhkh3 zhkh4');
							$( "#mainForm" ).addClass('zhkh1');
							console.log('pmo_2');
							$( "#tabs" ).tabs( "enable", "#objListContaner" );
						} break;
						case 'pmo3':{
						};
						case 'pmo_3':{
							let headerText = 'Паспорт МО. ';
							headerText += (doEdit) ? 'Правка отчёта Тепловые сети' : 'Новый отчёт Тепловые сети';
							$('#formBox .formHeader').text(headerText);
//							$('#formBox .formHeader').text('Паспорт МО. Тепловые сети');
							$( "#mainForm" ).css({'width':'900px'});
							$( "#mainForm" ).removeClass('zhkh1 zhkh2 zhkh4');
							$( "#mainForm" ).addClass('zhkh3');
						} break;
						case 'pmo4':{
						};
						case 'pmo_4':{
							let headerText = 'Паспорт МО. ';
							headerText += (doEdit) ? 'Правка отчёта Объекты водоснабжения и водоотведения' : 'Новый отчёт Объекты водоснабжения и водоотведения';
							$('#formBox .formHeader').text(headerText);
//							$('#formBox .formHeader').text('Паспорт МО. Объекты водоснабжения и водоотведения');
							$( "#mainForm" ).css({'width':'1140px'});
							$( "#mainForm" ).removeClass('zhkh1 zhkh2 zhkh3 zhkh4');
							$( "#mainForm" ).addClass('zhkh2');
						} break;
						case 'pmo5':{
						};
						case 'pmo_5':{
							let headerText = 'Паспорт МО. ';
							headerText += (doEdit) ? 'Правка отчёта Объекты электроснабжения' : 'Новый отчёт Объекты электроснабжения';
							$('#formBox .formHeader').text(headerText);
//							$('#formBox .formHeader').text('Паспорт МО. Объекты электроснабжения');
							$( "#mainForm" ).css({'width':'700px'});
							$( "#mainForm" ).removeClass('zhkh1 zhkh2 zhkh3 zhkh4');
							$( "#mainForm" ).addClass('zhkh1');
						} break;
						case 'pmo6':{							
						}
						case 'pmo_6':{
							let headerText = 'Паспорт МО. ';
							headerText += (doEdit) ? 'Правка бесхозяйного объекта коммунальной инфраструктуры' : 'Новый бесхозяйный объекта коммунальной инфраструктуры';
							$('#formBox .formHeader').text(headerText);
//							$('#formBox .formHeader').text('Паспорт МО. Бесхозяйные объекты коммунальной инфраструктуры');
							$( "#mainForm" ).css({'width':'600px'});
							$( "#mainForm" ).removeClass('zhkh1 zhkh2 zhkh3 zhkh4');
							$( "#mainForm" ).addClass('zhkh1');
							$( "#tabs" ).tabs( "enable", "#objListContaner" );
						} break;
						case 'pmo7':{							
						};
						case 'pmo_7':{
							let headerText = 'Паспорт МО. ';
							headerText += (doEdit) ? 'Правка отчёта Приборы коммерческого учета' : 'Новый отчёт Приборы коммерческого учета';
							$('#formBox .formHeader').text(headerText);
//							$('#formBox .formHeader').text('Паспорт МО. Приборы коммерческого учета');
							$( "#mainForm" ).css({'width':'1000px'});
							$( "#mainForm" ).removeClass('zhkh1 zhkh2 zhkh3 zhkh4');
							$( "#mainForm" ).addClass('zhkh3');
						} break;
						case 'pmo8':{							
						};
						case 'pmo_8':{
							let headerText = 'Паспорт МО. ';
							headerText += (doEdit) ? 'Правка отчёта Прочие объекты ЖКХ' : 'Новый отчёт Прочие объекты ЖКХ';
							$('#formBox .formHeader').text(headerText);
//							$('#formBox .formHeader').text('Паспорт МО. Прочие объекты ЖКХ');
							$( "#mainForm" ).css({'width':'600px'});
							$( "#mainForm" ).removeClass('zhkh1 zhkh2 zhkh3 zhkh4');
							$( "#mainForm" ).addClass('zhkh1');
						} break;
						case 'pmo9':{
						};
						case 'pmo_9':{
							let headerText = 'Паспорт МО. ';
							headerText += (doEdit) ? 'Правка отчёта Автономные резервные источники электроснабжения (АРИЭ)' : 'Новый отчёт Автономные резервные источники электроснабжения (АРИЭ)';
							$('#formBox .formHeader').text(headerText);
//							$('#formBox .formHeader').text('Паспорт МО. Автономные резервные источники электроснабжения');
							$( "#mainForm" ).css({'width':'1000px'});
							$( "#mainForm" ).removeClass('zhkh1 zhkh2 zhkh3 zhkh4');
							$( "#mainForm" ).addClass('zhkh1');
						} break;
					}
					formEl = this.getElements(formName, cloneMessId);
					$("#mainForm ").html('');
					$("#mainForm ").dform(formEl);
					cloneMessId	= "";					
					doEdit = false;	
					$(".maskFloat").mask('0000000000000', {'translation': {0: {pattern: /[0-9.,*]/}}});
					$(".maskFlSlash").mask('0000000000000', {'translation': {0: {pattern: /[0-9/.,*]/}}});
					$(".maskFloat").on('change' , function (event) {
						//console.log($('#' + event.currentTarget.id).val());
						$('#' + event.currentTarget.id).val(ROUT.str_replace( ',', '.', $('#' + event.currentTarget.id).val()));
					});
					$(".maskFlSlash").on('change' , function (event) {
						//console.log($('#' + event.currentTarget.id).val());
						$('#' + event.currentTarget.id).val(ROUT.str_replace( ',', '.', $('#' + event.currentTarget.id).val()));
					});
					$("#formSubmit").off('click');
					$("#formSubmit").on('click' , function (event) {
						UI.pleaseWait();			
						var formData = $("#mainForm").serializeJSON();
						console.log(formData);
						$.post("/spddl/", {type:'addReport', formName:formName, data:formData}, function(str)
							{
							let messSuccess = (doEdit) ? 'Отчёт успешно изменён' : 'Отчёт успешно доставлен';
							let messFailed = (doEdit) ? ' изменения ' : ' доставки ';							
							UI.pleaseWait();			
							console.log(str); 			
							if(str == 1){
									UI.showMessage('info', messSuccess);
									$("#mConfirm").on('click' , function (event) {
											window.location.href = window.location.href; 										
									});
								} else {
									UI.showMessage('error', 'Произошла ошибка в процессе ' + messFailed + ' отчёта '+ str);												
								}						
						});
					});	
				} break;
				case 'messContaner' :{				
					$( "#tabs" ).tabs( "disable", "#formContaner" );				
					$( "#tabs" ).tabs( "disable", "#objListContaner" );				
				} break;
				case 'zhournalContaner': {
					doEdit = false;	
					$( "#tabs" ).tabs( "disable", "#formContaner" );				
					$( "#tabs" ).tabs( "disable", "#messContaner" );				
					$( "#tabs" ).tabs( "disable", "#objListContaner" );				
				} break;				
				case 'objListContaner': {
					doEdit = false;	
					$( "#tabs" ).tabs( "disable", "#formContaner" );				
					$( "#tabs" ).tabs( "disable", "#messContaner" );				
					var contentList = listHeader = objName = '';

//					content +="<h1>Отчёты</h1>"  + 
//								"</div>";
					switch(formName){
/*						case 'pmo_1':{
							objName = 'Характеристика объектов ЖКХ';
							listHeader = 'Паспорт МО. Характеристика объектов ЖКХ';
							$("#objListContaner #mainList").css({'width':'600px'});
							if(MESS.PMO1 != 0){
							$(MESS.PMO1).each(function(indx, element){									
									contentList += "<div class='message '><span class='activeLink showMess' id='pmo1_"+element.id+"'>  " + element.cell_1 +  " <span class='hilight_2'>(актуально на " + element.upDate_ru +  ")</span> " + "</span></div>"; 
								});
							} else {
								contentList += "<div class='message '>Отчёты отстутствуют!</div>"; 
							}						
						} break;	*/						
						case 'pmo2':{
							objName = 'Теплоисточник';
							listHeader = 'Паспорт МО. Теплоисточники';
							$("#objListContaner #mainList").css({'width':'600px'});
							if(MESS.PMO2 != 0){
							$(MESS.PMO2).each(function(indx, element){									
									contentList += "<div class='message '><span class='activeLink showMess' id='pmo2_"+element.id+"'>  " + element.cell_1 +  " <span class='hilight_2'>(актуально на " + element.upDate_ru +  ")</span> " + "</span> &nbsp;&nbsp; <span class= 'deleteElement activeLink redDark' id='del_pmo2_" + element.id +  "'>удалить</span></div>"; 
								});
							} else {
								contentList += "<div class='message '>Объекты отстутствуют!</div>"; 
							}						
						} break;						
						case 'pmo6':{
							objName = 'Бесхозяйный объект';
							listHeader = 'Паспорт МО. Бесхозяйные объекты коммунальной инфраструктуры';
							$("#objListContaner #mainList").css({'width':'1100px'});
							if(MESS.PMO6 != 0){
							$(MESS.PMO6).each(function(indx, element){									
									contentList += "<div class='message '><span class='rowNum'>" + (indx+1) + "</span><span class='activeLink showMess' id='pmo6_"+element.id+"'>  " + element.cell_3  + "  " + element.cell_1 +  " <span class='hilight_2'>(актуально на " + element.upDate_ru +  ")</span> " + "</span>&nbsp;&nbsp; <span class= 'deleteElement activeLink redDark' id='del_pmo6_" + element.id +  "'>удалить</span></div>"; 
								});
							} else {
								contentList += "<div class='message '>Объекты отстутствуют!</div>"; 
							}						
						} break;
					}
					content ='<h1>' + listHeader + '</h1><div class="">' + contentList + '</div>';	
					content +="<div class='commAdd' style='text-align: center;'> " + 
						"<span class='activeButton newItem' title='Создать новый отчёт объект - " + objName + "' id='" + formName + "'>Добавить " + objName + "</span>" +
						"</div>";
					$("#objListContaner #mainList").html(content);
					$('#objListContaner .showMess').on('click', function (event) {
						var nextPage = 'formContaner';
						var activePage = 1;
						var argArr = event.currentTarget.id.split('_');
						formName = argArr[0];
						cloneMessId = argArr[1];
						doEdit = true; 						
						console.log(event.currentTarget.id);
						$("#tabs" ).tabs( "enable", "#" + nextPage); 
						$("#tabs").tabs( "option", "active", activePage ); 			
					});
					$('.deleteElement').on('click', function (event) {
						let itemIndex = parseInt(ROUT.GetStrPrt(event.currentTarget.id, '_', 2));
						let itemType = ROUT.GetStrPrt(event.currentTarget.id, '_', 1);
//						if confirm('Удалить выбранный элемент?delete element ' + itemIndex + ' of ' + itemType );
						if (confirm('Удалить выбранный элемент?')) {
							UI.pleaseWait();			
							$.post("/spddl/", {type:'deleteFromReport', itemType:itemType, itemIndex:itemIndex}, function(str)
								{
								let messSuccess = 'Элемент успешно удалён';
								let messFailed = 'Не удалось удалить элемент';							
								UI.pleaseWait();			
								console.log(str); 			
								if(str == 1){
										UI.showMessage('info', messSuccess);
										$("#mConfirm").on('click' , function (event) {
												window.location.href = window.location.href; 										
										});
									} else {
										UI.showMessage('error', messFailed + ' : '+ str);												
									}						
							});
						}
					});
					$('.newItem').on('click', function (event) {
						var nextPage = 'formContaner';
						var activePage = 1;
						formName = event.currentTarget.id; 
						$("#tabs" ).tabs( "enable", "#" + nextPage); 
						$("#tabs").tabs( "option", "active", activePage ); 				
					});
				} break;
			}

		}
	}
	
	this.formSended = false;

	this.showMessAdm = function(formType, messId, tableIndex = 0){
		console.log(arguments);
		$( "#tabs" ).tabs( "enable", "#messContaner" );
		$( "#tabs" ).tabs( "option", "active", 2 );
		var content = contentComm = '';
		var cloneEnable = true;
		switch(formType){
			case 'SFO':{
				var value = caption = tableName = '';
				var from = to = 0;
//				content += 'SFO_' + tableIndex;			
				tIndex = tableIndex;
				switch(tableIndex){
					case '1':{
						from = 3;
						to = 16;
						tableName = 'Отчёт СФО Таблица 1 (Жилой фонд)';
						var sfoField = sfoField_1;
					} break;
					case '2':{
						from = 17;
						to = 25;
						tableName = 'Отчёт СФО Таблица 2 (Котельные)';
						var sfoField = sfoField_2;
					} break;
					case '3':{
						from = 42;
						to = 61;
						tableName = 'Отчёт СФО Таблица 3 (Сети)';
						var sfoField = sfoField_3;
					} break;
					case '4':{
						from = 26;
						to = 41;
						tableName = 'Отчёт СФО Таблица 4 (Финансовые средства на подготовку к зиме ЖКХ)';
						var sfoField = sfoField_4;
					} break;
					case '5':{
						from = 62;
						to = 71;
						tableName = 'Отчёт СФО Таблица 5 (Топливо)';
						var sfoField = sfoField_5;
					} break;
				}
//				console.log(sfoField);
				$(MESS.SFO).each(function(indx, element){
//					console.log(element);
					if(!element[0].archieved){								
						cloneEnable = false;															
					}
					if(element[0].sendDate == messId){
						content += "<div class='objTitle' id='panObjTitle'> " + tableName +  " от " + element[0].sendDate_ru +" </div>	<div class='objPropertiesContaner'>";
						for (key in element[0]){
							if((element[0][key]!=null)&&(element[0][key]!=undefined)&&(key!='comments')){
								let keyIndex = parseInt(ROUT.GetStrPrt(key, '_', 1));
//								console.log(key, from, to, keyIndex);
								if((keyIndex>=from)&&(keyIndex<=to)){
									value = element[0][key];
									caption = ROUT.str_replace( '(', '<span class="hilight_2">', ROUT.str_replace( '[', '<span class="hilight_1">', ROUT.str_replace( ')', '</span>', ROUT.str_replace( ']', '</span>', sfoField[key] ))));
									content += "<div   class='objPropItem'> <div class='objPropName'>" + caption + 
												"</div><div class='objPropValue p_valueSelectType'>" + value + "</div></div>";
								}
							}						
						}					
					}
				});						
			} break;
			case 'toplPril2':{
				var value1 = value2 = value3 = value4 = '';
				$(MESS.toplPril2).each(function(indx, element){
					if(!element[0].archieved){								
						cloneEnable = false;															
					}
					if(element[0].sendDate == messId){
						//console.log(element);
//				arr.forEach(function(key, indx, arr){	
						
						content += "<div class='objTitle' id='panObjTitle'>	Отчёт Топливо Приложение 2 (расход) " +  " от " + element[0].sendDate_ru +" </div>	<div class='objPropertiesContaner'>";
						content += "<div   class='objPropItem '> <div class='objPropName' style='width:350px; '></div><div class='objPropValue p_valueSelectType' style='width:1025px;  '>" + 
								"<span class='rowValue hilight_1' style='width:108px;'>Уголь, т</span>" +
								"<span class='rowValue hilight_1' style='width:108px;'>Мазут, т</span>" +
								"<span class='rowValue hilight_1' style='width:108px;'>Нефть, т</span>" +
								"<span class='rowValue hilight_1' style='width:108px;'>Газоконденсат, т</span>" +
								"<span class='rowValue hilight_1' style='width:108px;'>ПБФ, т</span>" +
								"<span class='rowValue hilight_1' style='width:108px;'>Дрова, т</span>" +
								"<span class='rowValue hilight_1' style='width:108px;'>Щепа, т</span>" +
								"<span class='rowValue hilight_1' style='width:108px;'>Газ, тыс.куб.м</span>" +
								"</div></div>";
						for (key in tPr2Field){
							if((element[0][key]!=null)&&(element[0][key]!=undefined)&&(key!='comments')){
								value1 = element[0][key];
								value2 = element[1][key];
								value3 = element[2][key];
								value4 = element[3][key];
								value5 = element[4][key];
								value6 = element[5][key];
								value7 = element[6][key];
								value8 = element[7][key];
								caption = ROUT.str_replace( '(', '<span class="hilight_2">', ROUT.str_replace( '[', '<span class="hilight_1">', ROUT.str_replace( ')', '</span>', ROUT.str_replace( ']', '</span>', tPr2Field[key].label ))));
								content += "<div   class='objPropItem'> <div class='objPropName' style='width:350px;'>" + caption + 
							"</div><div class='objPropValue p_valueSelectType' style='width:1025px;' ><span class='rowValue' style='width:108px;'>" + value1 + 
							"</span><span class='rowValue' style='width:108px;'>" + value2 + 
							"</span><span class='rowValue' style='width:108px;'>" + value3 + 
							"</span><span class='rowValue' style='width:108px;'>" + value4 + 
							"</span><span class='rowValue' style='width:108px;'>" + value5 + 
							"</span><span class='rowValue' style='width:108px;'>" + value6 + 
							"</span><span class='rowValue' style='width:108px;'>" + value7 + 
							"</span><span class='rowValue' style='width:108px;'>" + value8 + 
							"</span></div></div>";
							}						
						}	
					}						
				});				
			} break;
			case 'toplPril1':{
				var value = caption = '';
				$(MESS.toplPril1).each(function(indx, element){
					console.log(element);
					if(!element[0].archieved){								
						cloneEnable = false;															
					}
					if(element[0].sendDate == messId){
						content += "<div class='objTitle' id='panObjTitle'>	Отчёт Топливо Приложение 1 (наличие) " +  " от " + element[0].sendDate_ru +" </div>	<div class='objPropertiesContaner'>";
						for (key in toplPril1Field){
							if((element[0][key]!=null)&&(element[0][key]!=undefined)&&(key!='comments')){
								value = element[0][key];
								caption = ROUT.str_replace( '(', '<span class="hilight_2">', ROUT.str_replace( '[', '<span class="hilight_1">', ROUT.str_replace( ')', '</span>', ROUT.str_replace( ']', '</span>', toplPril1Field[key] ))));
								content += "<div   class='objPropItem'> <div class='objPropName'>" + caption + 
							"</div><div class='objPropValue p_valueSelectType'>" + value + "</div></div>";
							}						
						}					
					}
				});						
			} break;
			case 'zhkh1':{
				var value1 = value2 = value3 = value4 = '';
				$(MESS.zhkh1).each(function(indx, element){
					if(!element[0].archieved){								
						cloneEnable = false;															
					}
					if(element[0].sendDate == messId){
						//console.log(element);
						content += "<div class='objTitle' id='panObjTitle'>	Отчёт по форме 1-ЖКХ " +  " от " + element[0].sendDate_ru +" </div>	<div class='objPropertiesContaner'>";
						content += "<div   class='objPropItem'> <div class='objPropName'></div><div class='objPropValue p_valueSelectType'><span class='rowValue hilight_1'>всего</span><span class='rowValue hilight_1'>план года</span><span class='rowValue hilight_1'>факт</span><span class='rowValue hilight_1'>кап.рем., реконстр.</span></div></div>";
						for (key in zhkh1Field){
							if((element[0][key]!=null)&&(element[0][key]!=undefined)&&(key!='comments')){
								value1 = element[0][key];
								value2 = element[1][key];
								value3 = element[2][key];
								value4 = element[3][key];
								caption = ROUT.str_replace( '(', '<span class="hilight_2">', ROUT.str_replace( '[', '<span class="hilight_1">', ROUT.str_replace( ')', '</span>', ROUT.str_replace( ']', '</span>', zhkh1Field[key] ))));
								content += "<div   class='objPropItem'> <div class='objPropName'>" + caption + 
							"</div><div class='objPropValue p_valueSelectType'><span class='rowValue'>" + value1 + "</span><span class='rowValue'>" + value2 + "</span><span class='rowValue'>" + value3 + "</span><span class='rowValue'>" + value4 + "</span></div></div>";
							}						
						}					
					}					
				});				
			} break;
			case 'zhkh3':{
				var value1 = value2 = value3 = value4 = '';
				$(MESS.zhkh3).each(function(indx, element){
					if(!element[0].archieved){								
						cloneEnable = false;															
					}
					if(element[0].sendDate == messId){
						//console.log(element);
//				arr.forEach(function(key, indx, arr){	
						
						content += "<div class='objTitle' id='panObjTitle'>	Отчёт по форме 3-ЖКХ " +  " от " + element[0].sendDate_ru +" </div>	<div class='objPropertiesContaner'>";
						content += "<div   class='objPropItem '> <div class='objPropName' style='width:300px; height:60px;'></div><div class='objPropValue p_valueSelectType' style='width:1025px;  height:60px;'>" + 
								"<span class='rowValue hilight_1' style='width:125px;'>Фактически поставлено с начала отопительного сезона</span>" +
								"<span class='rowValue hilight_1' style='width:125px;'>Фактически израсходовано с начала отопительного сезона</span>" +
								"<span class='rowValue hilight_1' style='width:125px;'>Объемы запасов топлива на конец отчетного периода</span>" +
								"<span class='rowValue hilight_1' style='width:125px;'>Объем договорных обязательств по поставкам топлива</span>" +
								"<span class='rowValue hilight_1' style='width:125px;'>Объем поставок местного топлива</span>" +
								"<span class='rowValue hilight_1' style='width:125px;'>Среднесложившаяся по договорам стоимость топлива</span>" +
								"<span class='rowValue hilight_1' style='width:125px;'>Задолженность за ранее потребленные ТЭР, млн.руб.</span>" +
								"</div></div>";
						for (key in zhkh3Field){
							if((element[0][key]!=null)&&(element[0][key]!=undefined)&&(key!='comments')){
								value1 = element[0][key];
								value2 = element[1][key];
								value3 = element[2][key];
								value4 = element[3][key];
								value5 = element[4][key];
								value6 = element[5][key];
								value7 = (element[6]!=undefined)?element[6][key]:0;
								caption = ROUT.str_replace( '(', '<span class="hilight_2">', ROUT.str_replace( '[', '<span class="hilight_1">', ROUT.str_replace( ')', '</span>', ROUT.str_replace( ']', '</span>', zhkh3Field[key].label ))));
								content += "<div   class='objPropItem'> <div class='objPropName' style='width:300px;'>" + caption + 
							"</div><div class='objPropValue p_valueSelectType' style='width:1025px;' ><span class='rowValue' style='width:125px;'>" + value1 + 
							"</span><span class='rowValue' style='width:125px;'>" + value2 + 
							"</span><span class='rowValue' style='width:125px;'>" + value3 + 
							"</span><span class='rowValue' style='width:125px;'>" + value4 + 
							"</span><span class='rowValue' style='width:125px;'>" + value5 + 
							"</span><span class='rowValue' style='width:125px;'>" + value6 + 
							"</span><span class='rowValue' style='width:125px;'>" + value7 + 
							"</span></div></div>";
							}						
						}	
					}						
				});				
			} break;			
			case 'pmo1':{
//				console.log(MESS.PMO1);
				var value1 = value2 = value3 = value4 = '';
				$(MESS.PMO1).each(function(indx, element){
					if(!element[0].archieved){								
						cloneEnable = false;															
					}
					if(element[0].sendDate == messId){
						
						content += "<div class='objTitle' id='panObjTitle'>	Характеристика объектов ЖКХ " +  " от " + element[0].sendDate_ru +" </div>	<div class='objPropertiesContaner'>";
						content += "<div   class='objPropItem '> <div class='objPropName' style='width:450px; height:60px;'></div><div class='objPropValue p_valueSelectType' style='width:800px;  height:60px;'>" + 
								"<span class='rowValue hilight_1' style='width:150px;'>Жилищный фонд всего</span>" +
								"<span class='rowValue hilight_1' style='width:150px;'>Жилищный фонд подключенный к централизованному теплоснабжению</span>" +
								"</div></div>";
						for (key in pmo1Field){
							if((element[0][key]!=null)&&(element[0][key]!=undefined)&&(key!='comments')){
								value1 = element[0][key];
								value2 = element[1][key];								
								caption = ROUT.str_replace( '(', '<span class="hilight_2">', ROUT.str_replace( '[', '<span class="hilight_1">', ROUT.str_replace( ')', '</span>', ROUT.str_replace( ']', '</span>', pmo1Field[key].label ))));
								content += "<div   class='objPropItem'> <div class='objPropName' style='width:450px;'>" + caption + 
							"</div><div class='objPropValue p_valueSelectType' style='width:1025px;' >" + 
							"<span class='rowValue' style='width:150px;'>" + value1 + 
							"</span><span class='rowValue' style='width:150px;'>" + value2 + 
							"</span></div></div>";
							}
						}
					}
				});	
			} break;			
			case 'pmo3':{ 
//				console.log(MESS.PMO1);
				var value1 = value2 = value3 = value4 = '';
				$(MESS.PMO3).each(function(indx, element){
					//console.log(element);
					if(!element[0].archieved){								
						cloneEnable = false;															
					}
					if(element[0].sendDate == messId){
						
//						content += "<div class='objTitle' id='panObjTitle'>	Тепловые сети" +  " от " + element[0].sendDate_ru +" </div>	<div id='pmo3Arch' class='objPropertiesContaner zhkh3' style='width: 1025px;'>";
						content += "<div class='objTitle' id='panObjTitle'>	Тепловые сети" +  " от " + element[0].sendDate_ru +" </div>	<div id='pmo3Arch' class='objPropertiesContaner zhkh3' style='width: auto;'>";
						content += '<div class="ui-dform-div rowHeaderSingle">Общая протяженность тепловых сетей в 2-х трубном исчислении</div>'+
									'<div class="ui-dform-div rowHeaderStart" style="width:450px;"></div>'+
									'<div class="ui-dform-div rowHeader">всего <span class="hilight_2">км.</span></div>'+
									'<div class="ui-dform-div rowHeader">всего, в.т.ч. ветхие <span class="hilight_2">км.</span> </div>'+
									'<div class="ui-dform-div rowHeader">диаметр до 200мм <span class="hilight_2">км.</span> </div>'+
									'<div class="ui-dform-div rowHeader">диаметр от 200мм до 400мм <span class="hilight_2">км.</span> </div>'+
									'<div class="ui-dform-div rowHeader">диаметр от 400мм до 600мм <span class="hilight_2">км.</span> </div>'+
									'<div class="ui-dform-div rowHeader">диаметр более 600мм <span class="hilight_2">км.</span></div>'+
									'<div class="ui-dform-div rowEnd"></div>';
						let index = 0;
						for (key in pmo3Head){
//							if((element[0][key]!=null)&&(element[0][key]!=undefined)&&(key!='comments')){
							if((element[indx]['cell_1']!=null)&&(element[indx]['cell_1']!=undefined)){
								value1 = element[index]['cell_1'];
								value2 = element[index]['cell_2'];								
								value3 = element[index]['cell_3'];
								value4 = element[index]['cell_4'];								
								value5 = element[index]['cell_5']; 
								value6 = element[index]['cell_6'];								
								caption = ROUT.str_replace( '(', '<span class="hilight_2">', ROUT.str_replace( '[', '<span class="hilight_1">', ROUT.str_replace( ')', '</span>', ROUT.str_replace( ']', '</span>', pmo3Head[key].label ))));
								content += "<div   class='objPropItem'> <div class='objPropName' style='width:450px;'>" + caption + 
//							"</div><div class='objPropValue p_valueSelectType' style='width:1025px;' >" + 
							"</div><div class='objPropValue p_valueSelectType' style='width:1025px;' >" + 
							"<span class='rowValue' style='width:100px;'>" + value1 + 
							"</span><span class='rowValue' style='width:100px; margin-left:14px;'>" + value2 + 
							"</span><span class='rowValue' style='width:100px; margin-left:14px;'>" + value3 + 
							"</span><span class='rowValue' style='width:100px; margin-left:14px;'>" + value4 + 
							"</span><span class='rowValue' style='width:100px; margin-left:14px;'>" + value5 + 
							"</span><span class='rowValue' style='width:100px; margin-left:14px;'>" + value6 + 
							"</span></div></div>";
							index ++;
							}
						}
					}
				});	
			} break;
		/*$(MESS).each(function(indx, element){
		});*/
			case 'pmo4':{
//				console.log(MESS.PMO1);
				var value1 = value2 = value3 = value4 = '';
				$(MESS.PMO4).each(function(indx, element){
					if(!element[0].archieved){								
						cloneEnable = false;															
					}
//					console.log(element);
					if(element[0].sendDate == messId){
						
						content += "<div class='objTitle' id='panObjTitle'>	Объекты водоснабжения и водоотведения " +  " от " + element[0].sendDate_ru +" </div>	<div class='objPropertiesContaner zhkh2'  style='width: auto;'>";

						content += '<div class="ui-dform-div rowHeaderStart" style="width:357px; ">&nbsp;</div> ' +
									'<div class="ui-dform-div rowHeader" style="width:95px; border-left: 1px solid #ccc; padding: 5px 0 5px 0;">Мун. магистр. в подземном исполнении</div> ' +
									'<div class="ui-dform-div rowHeader" style="width:95px; border-left: 1px solid #ccc; padding: 5px 0 5px 0;">Мун. магистр. надземном исполнении</div> ' +
									'<div class="ui-dform-div rowHeader" style="width:95px; border-left: 1px solid #ccc; padding: 5px 0 5px 0;">Мун. магистр. средний уровень износа в %</div> ' +
									'<div class="ui-dform-div rowHeader" style="width:95px; border-left: 1px solid #ccc; padding: 5px 0 5px 0;">Мун. распред. в подземном исполнении</div> ' +
									'<div class="ui-dform-div rowHeader" style="width:95px; border-left: 1px solid #ccc; padding: 5px 0 5px 0;">Мун. распред. надземном исполнении</div> ' +
									'<div class="ui-dform-div rowHeader" style="width:95px; border-left: 1px solid #ccc; padding: 5px 0 5px 0;">Мун. распред. средний уровень износа в %</div> ' +
									'<div class="ui-dform-div rowHeader" style="width:95px; border-left: 1px solid #ccc; padding: 5px 0 5px 0;">Ведомств. магистр. в подземном исполнении</div> ' +
									'<div class="ui-dform-div rowHeader" style="width:95px; border-left: 1px solid #ccc; padding: 5px 0 5px 0;">Ведомств. магистр. надземном исполнении</div> ' +
									'<div class="ui-dform-div rowHeader" style="width:95px; border-left: 1px solid #ccc; padding: 5px 0 5px 0;">Ведомств. магистр. средний уровень износа в %</div> ' +
									'<div class="ui-dform-div rowHeader" style="width:95px; border-left: 1px solid #ccc; padding: 5px 0 5px 0;">Ведомств. распред. в подземном исполнении</div> ' +
									'<div class="ui-dform-div rowHeader" style="width:95px; border-left: 1px solid #ccc; padding: 5px 0 5px 0;">Ведомств. распред. надземном исполнении</div> ' +
									'<div class="ui-dform-div rowHeader" style="width:95px; border-left: 1px solid #ccc; padding: 5px 0 5px 0;">Ведомств. распред. средний уровень износа в %</div> ' +
									'<div class="ui-dform-div rowEnd"> ' +
									'</div>';
						let arr = pmo4Field;
						var counter = 0;
						for (key in arr){	
//							console.log(key, indx, counter);
							if(ROUT.is_string(arr[key].label)){
								if((element[0]['cell_1']!=null)&&(element[0]['cell_1']!=undefined)){
									caption = ROUT.str_replace( '(', '<span class="hilight_2">', ROUT.str_replace( '[', '<span class="hilight_1">', ROUT.str_replace( ')', '</span>', ROUT.str_replace( ']', '</span>', arr[key].label ))));
									content += "<div   class='objPropItem'> <div class='objPropName' style='width:350px;'>" + caption + "</div><div class='objPropValue p_valueSelectType' style='width:1230px;' >";
									var count= 0;
									for (key1 in pmo4Head){	
										if(count){
											content += "<span class='rowValue' style='width:86px; margin-left:14px;' title='" + pmo4Head[key1].title + "' >" + element[count][key] + "</span>";

										} else {
												content += "<span class=' rowValue' style='width:100px; margin-left:14px;' title='" + pmo4Head[key1].title + "' >" + element[count][key] + "</span>";
										}								
										count ++;
									}
									
									content += "</div></div>";

								}										
							}
							counter++;
						}
					}
				});	
			} break;
			case 'pmo5':{
				console.log(MESS.PMO5);
				var value1 = value2 = value3 =  '';
				$(MESS.PMO5).each(function(indx, element){
					if(!element[0].archieved){								
						cloneEnable = false;															
					}
//					console.log(element);
					if(element[0].sendDate == messId){
						
						content += "<div class='objTitle' id='panObjTitle'>	Объекты электроснабжения " +  " от " + element[0].sendDate_ru +" </div>	<div class='objPropertiesContaner zhkh1'  style='width: auto;'>";

//						content += '<div class="ui-dform-div rowHeaderStart" style="width:357px; ">&nbsp;</div> ' +
						content += '<div class="ui-dform-div rowHeaderStart"  style="width:450px; ">&nbsp;</div> ' +
									'<div class="ui-dform-div rowHeader" style="width:150px; ">Муниципальные</div> ' +
									'<div class="ui-dform-div rowHeader" style="width:150px; ">Ведомственные</div> ' +
									'<div class="ui-dform-div rowHeader" style="width:150px; ">Частные</div> ' +
									'<div class="ui-dform-div rowEnd"> ' +
									'</div>';
						let arr = pmo5Field;
						var counter = 0;
						for (key in arr){	
//							console.log(key, indx, counter);
							if(ROUT.is_string(arr[key].label)){
								if((element[0]['cell_1']!=null)&&(element[0]['cell_1']!=undefined)){
									value1 = element[0][key];
									value2 = element[1][key];								
									value3 = element[2][key];								
									
									caption = ROUT.str_replace( '(', '<span class="hilight_2">', ROUT.str_replace( '[', '<span class="hilight_1">', ROUT.str_replace( ')', '</span>', ROUT.str_replace( ']', '</span>', arr[key].label ))));
									content += "<div   class='objPropItem'> <div class='objPropName' style='width:450px;'>" + caption + "</div><div class='objPropValue p_valueSelectType' style='width:1230px;' >";
									content += "<span class='rowValue' style='width:150px; margin-left:14px;' title='Муниципальные' >" + element[0][key] + "</span>";
									content += "<span class='rowValue' style='width:150px; margin-left:14px;' title='Ведомственные' >" + element[1][key] + "</span>";
									content += "<span class='rowValue' style='width:150px; margin-left:14px;' title='Частные' >" + element[2][key] + "</span>";
									content += "</div></div>";
								}										
							}
							counter++;
						}
					}
				});	
			} break;			
			case 'pmo7':{
				console.log(MESS.PMO5);
				var value1 = value2 = value3 =  '';
				$(MESS.PMO7).each(function(indx, element){
					if(!element[0].archieved){								
						cloneEnable = false;															
					}
//					console.log(element);
					if(element[0].sendDate == messId){
						
						content += "<div class='objTitle' id='panObjTitle'>	Приборы коммерческого учета " +  " от " + element[0].sendDate_ru +" </div>	<div id='pmo7Arch' class='objPropertiesContaner zhkh3'  style='width: auto;'>";
content += '<div class="ui-dform-div rowHeaderStart"  style="width:450px;"></div><div class="ui-dform-div rowHeaderSingle1">Жилой фонд</div>' +
			'<div class="ui-dform-div rowHeaderSingle2">Объекты социальной сферы</div>' +
			'<div class="ui-dform-div rowEndStart"></div>' +
			'<div class="ui-dform-div rowHeaderStart" style="width:450px;"></div>' +
			'<div style="background-color:#ece790" class="ui-dform-div rowHeader80">муниципальный</div>' +
			'<div style="background-color:#ece790" class="ui-dform-div rowHeader80">государственный</div>' +
			'<div style="background-color:#ece790" class="ui-dform-div rowHeader80">частный</div>' +
			'<div style="background-color:#c2ecff" class="ui-dform-div rowHeader80">здравоохране ния</div>' +
			'<div style="background-color:#c2ecff" class="ui-dform-div rowHeader80">образования</div>' +
			'<div style="background-color:#c2ecff" class="ui-dform-div rowHeader80">социального развития</div>' +
			'<div style="background-color:#c2ecff" class="ui-dform-div rowHeader80">физической культуры и спорта</div>' +
			'<div style="background-color:#c2ecff" class="ui-dform-div rowHeader80">культуры и архивов</div>' +
			'<div style="background-color:#f7f7f7" class="ui-dform-div rowHeader80">Прочие</div>' +
			'<div class="ui-dform-div rowEnd"></div>';
						let arr = pmo7Field;
						var counter = 0;
						for (key in arr){	
//							console.log(key, indx, counter);
							if(ROUT.is_string(arr[key].label)){
								if((element[0]['cell_1']!=null)&&(element[0]['cell_1']!=undefined)){
									caption = ROUT.str_replace( '(', '<span class="hilight_2">', ROUT.str_replace( '[', '<span class="hilight_1">', ROUT.str_replace( ')', '</span>', ROUT.str_replace( ']', '</span>', arr[key].label ))));
									content += "<div   class='objPropItem'> <div class='objPropName' style='width:450px;'>" + caption + "</div><div class='objPropValue p_valueSelectType' style='width:1230px;' >";
									var count= 0;
									for (key1 in pmo7Head){	
										if(count){
											content += "<span class='rowValue' style='width:80px; margin-left:5px;' title='" + pmo7Head[key1].title + "' >" + element[count][key] + "</span>";

										} else {
												content += "<span class=' rowValue' style='width:80px; margin-left:1px;' title='" + pmo7Head[key1].title + "' >" + element[count][key] + "</span>";
										}								
										count ++;
									}
									content += "</div></div>";
								}										
							}
							counter++;
						}
					}
				});	
			} break;			
			case 'pmo8':{
//				console.log(MESS.PMO8);
				var value1 = value2 =  '';
				$(MESS.PMO8).each(function(indx, element){
					if(!element[0].archieved){								
						cloneEnable = false;															
					}
//					console.log(element);
					if(element[0].sendDate == messId){
						
						content += "<div class='objTitle' id='panObjTitle'>	Прочие объекты ЖКХ " +  " от " + element[0].sendDate_ru +" </div>	<div  class='objPropertiesContaner '  style='width: auto;'>";
						content += "<div   class='objPropItem '> <div class='objPropName' style='width:450px; height:30px;'></div><div class='objPropValue p_valueSelectType' style='width:800px;  height:30px;'>" + 
								"<span class='rowValue hilight_1' style='width:150px;'>Муниципальные</span>" +
								"<span class='rowValue hilight_1' style='width:150px;'>Ведомственные</span>" +
								"</div></div>";
						var counter = 0;
						for (key in pmo8Field){
							if((element[0][key]!=null)&&(element[0][key]!=undefined)&&(key!='comments')){
								value1 = element[0][key];
								value2 = element[1][key];								
								caption = ROUT.str_replace( '(', '<span class="hilight_2">', ROUT.str_replace( '[', '<span class="hilight_1">', ROUT.str_replace( ')', '</span>', ROUT.str_replace( ']', '</span>', pmo8Field[key].label ))));
								content += "<div   class='objPropItem'> <div class='objPropName' style='width:450px;'>" + caption + 
							"</div><div class='objPropValue p_valueSelectType' style='width:1025px;' >" + 
							"<span class='rowValue' style='width:150px;'>" + value1 + 
							"</span><span class='rowValue' style='width:150px;'>" + value2 + 
							"</span></div></div>";
							}
						}
					}
				});	
			} break;			
			case 'pmo9':{
				console.log(MESS.PMO9);
				var value1 = value2 =  '';
				$(MESS.PMO9).each(function(indx, element){
					if(!element[0].archieved){								
						cloneEnable = false;															
					}
//					console.log(element);
					if(element[0].sendDate == messId){
						
						content += "<div class='objTitle' id='panObjTitle'>	Автономные резервные источники электроснабжения (АРИЭ) " +  " от " + element[0].sendDate_ru +" </div>	<div  class='objPropertiesContaner '  style='width: auto;'>";
						content += "<div   class='objPropItem '> <div class='objPropName' style='width:450px; height:30px;'></div><div class='objPropValue p_valueSelectType' style='width:800px;  height:30px;'>" + 
								"<span class='rowValue hilight_1' style='width:150px;'>Стационарных</span>" +
								"<span class='rowValue hilight_1' style='width:150px;'>Передвижных</span>" +
								"</div></div>";
						var counter = 0;
						for (key in pmo9Field){
							if((element[0][key]!=null)&&(element[0][key]!=undefined)&&(key!='comments')){
								value1 = element[0][key];
								value2 = element[1][key];								
								caption = ROUT.str_replace( '(', '<span class="hilight_2">', ROUT.str_replace( '[', '<span class="hilight_1">', ROUT.str_replace( ')', '</span>', ROUT.str_replace( ']', '</span>', pmo9Field[key].label ))));
								content += "<div   class='objPropItem'> <div class='objPropName' style='width:450px;'>" + caption + 
							"</div><div class='objPropValue p_valueSelectType' style='width:1025px;' >" + 
							"<span class='rowValue' style='width:150px;'>" + value1 + 
							"</span><span class='rowValue' style='width:150px;'>" + value2 + 
							"</span></div></div>";
							}
						}
					}
				});	
			} break;
		}
		if(cloneEnable)
			content += "<div class='commAdd'><span class='activeButton' title='Создать новый отчёт по образцу этого' id='cloneMess'> новый по образцу </span>";
		$('#messBody').html(content + contentComm);
		$('#commAd').on('click', function (event) { FORM.showCommentForm(messId); /*FORM.showCommentForm(messId));*/ }) ;
		$('#cloneMess').on('click', function (event) {
			event.stopPropagation();	
			cloneMessId = messId; console.log('cloneMessId is ' + cloneMessId);
//			console.log('cloneMessType is ' + formType);
			formName = formType; 
			$("#tabs" ).tabs( "enable", "#formContaner" );
			$("#tabs").tabs( "option", "active", 1 ); 
			}) ;
	}
			
	this.genMessListAdm = function(lId){
		var content = contentArch = contentArchTopl = contentArchStat = contentArchPMO = '';
//		content +="<h1>Отчёты</h1><div class='commAdd' style='margin: 5px 0px 15px 0px;'>"  + 
		content +="<h1>Новый отчёт</h1><div class='commAdd' style='margin: 5px 0px 15px 0px;'>"  + 
					"<h3>Паспорт МО</h3><div>"+
					"<span class='activeButton' title='Создать новый отчёт Паспорт МО. Приложение 1' id='pmo_1'> Характеристика объектов ЖКХ </span>" + 
					"<span class='activeButton' title='Создать новый отчёт Паспорт МО. Приложение 2' id='pmo2'>Теплоисточники </span>" + 
					"<span class='activeButton' title='Создать новый отчёт Паспорт МО. Приложение 3' id='pmo_3'>Тепловые сети </span>" + 
					"<span class='activeButton' title='Создать новый отчёт Паспорт МО. Объекты водоснабжения и водоотведения' id='pmo_4'>Объекты водоснабжения и водоотведения</span>" + 
					"<span class='activeButton' title='Создать новый отчёт Паспорт МО. Объекты электроснабжения' id='pmo_5'>Объекты электроснабжения</span></div>" + 
					"<div><span class='activeButton' title='Создать новый отчёт Паспорт МО. Бесхозяйные объекты коммунальной инфраструктуры' id='pmo6'>Бесхозяйные объекты</span>" + 
					"<span class='activeButton' title='Создать новый отчёт Паспорт МО. Приборы учёта' id='pmo_7'>Приборы учёта</span>" + 
					"<span class='activeButton' title='Создать новый отчёт Паспорт МО. Прочие объекты ЖКХ' id='pmo_8'>Прочие объекты ЖКХ</span>" + 
					"<span class='activeButton' title='Создать новый отчёт Паспорт МО. Автономные резервные источники электроснабжения' id='pmo_9'>АРИЭ</span></div>" + 
					"<h3>Наличие и расход топлива</h3><div>"+
					"<span class='activeButton' title='Создать новый отчёт по топливу Приложение 1' id='toplPril1'> Наличие (Приложение 1) </span>" + 
					"<span class='activeButton' title='Создать новый отчёт по топливу Приложение 2' id='toplPril2'> Расход  (Приложение 2) </span></div>" + 
					"<h3>Статистическая отчётность</h3><div>"+
					"<span class='activeButton' title='Создать новый отчёт СФО. Таблица 1' id='sfo_1'>СФО. Таблица 1 </span>" + 
					"<span class='activeButton' title='Создать новый отчёт СФО. Таблица 2' id='sfo_2'>СФО. Таблица 2 </span>" + 
					"<span class='activeButton' title='Создать новый отчёт СФО. Таблица 3' id='sfo_3'>СФО. Таблица 3 </span>" + 
					"<span class='activeButton' title='Создать новый отчёт СФО. Таблица 4' id='sfo_4'>СФО. Таблица 4 </span>" + 
					"<span class='activeButton' title='Создать новый отчёт СФО. Таблица 5' id='sfo_5'>СФО. Таблица 5 </span></div>" + 
					"<div><span class='activeButton' title='Создать новый отчёт по форме 1-ЖКХ' id='1zhkh'> Форма 1 ЖКХ </span>"+
					"<span class='activeButton' title='Создать новый отчёт по форме 2-ЖКХ' id='zhkh2'> Форма 2 ЖКХ </span>" +
					"<span class='activeButton' title='Создать новый отчёт по форме 2-ЖКХ' id='zhkh24'> Форма 2 ЖКХ Приложение 4</span>" +
					"<span class='activeButton' title='Создать новый отчёт по форме 3-ЖКХ' id='zhkh3'> Форма 3 ЖКХ </span></div>" +
					"</div>";
		$.post("/spddl/", {type:'getRepAll', formName:'start', distr:lId}, function(str){
			MESS = JSON.parse(str);
			console.log(MESS);
			if((MESS.PMO1==0)||(MESS.PMO1.length == 0))
				contentArchPMO +='';
			else {
				contentArchPMO +='<div class="repType"><h3>Характеристика объектов ЖКХ</h3>';						
				$(MESS.PMO1).each(function(indx, element){
//						console.log(element);
						if(element[0].archieved)
							contentArchPMO += "<div class='message '><span class='activeLink showMess' id='pmo1_"+element[0].sendDate+"'>Отчёт " +  " на " + element[0].sendDate_ru + "</span></div>"; 
						else
							contentArchPMO += "<div class='message redDark'><span class='activeLink showMess doEdit' id='pmo1_"+element[0].sendDate+"'>Отчёт за текущий период (на " + element[0].sendDate_ru + ")</span></div>"; 							
					});
				contentArchPMO +="</div>";
				}				
			if((MESS.PMO3==0)||(MESS.PMO3.length == 0))
				contentArchPMO +='';
			else {
				contentArchPMO +='<div class="repType"><h3>Тепловые сети</h3>';						
				$(MESS.PMO3).each(function(indx, element){
//						console.log(element);
						if(element[0].archieved)
							contentArchPMO += "<div class='message '><span class='activeLink showMess' id='pmo3_"+element[0].sendDate+"'>Отчёт " +  " на " + element[0].sendDate_ru + "</span></div>"; 
						else
							contentArchPMO += "<div class='message redDark'><span class='activeLink showMess doEdit' id='pmo3_"+element[0].sendDate+"'>Отчёт за текущий период (на " + element[0].sendDate_ru + ")</span></div>"; 							
					});
				contentArchPMO +="</div>";
				}				
			if((MESS.PMO4==0)||(MESS.PMO4.length == 0))
				contentArchPMO +='';
			else {
				contentArchPMO +='<div class="repType"><h3>Объекты водоснабжения и водоотведения</h3>';						
				$(MESS.PMO4).each(function(indx, element){
//						console.log(element);
						if(element[0].archieved)
							contentArchPMO += "<div class='message '><span class='activeLink showMess' id='pmo4_"+element[0].sendDate+"'>Отчёт " +  " на " + element[0].sendDate_ru + "</span></div>"; 
						else
							contentArchPMO += "<div class='message redDark'><span class='activeLink showMess doEdit' id='pmo4_"+element[0].sendDate+"'>Отчёт за текущий период (на " + element[0].sendDate_ru + ")</span></div>"; 							
					});
				contentArchPMO +="</div>";
				}				
			if((MESS.PMO5==0)||(MESS.PMO5.length == 0))
				contentArchPMO +='';
			else {
				contentArchPMO +='<div class="repType"><h3>Объекты электроснабжения</h3>';						
				$(MESS.PMO5).each(function(indx, element){
//						console.log(element);
						if(element[0].archieved)
							contentArchPMO += "<div class='message '><span class='activeLink showMess' id='pmo5_"+element[0].sendDate+"'>Отчёт " +  " на " + element[0].sendDate_ru + "</span></div>"; 
						else
							contentArchPMO += "<div class='message redDark'><span class='activeLink showMess doEdit' id='pmo5_"+element[0].sendDate+"'>Отчёт за текущий период (на " + element[0].sendDate_ru + ")</span></div>"; 							
					});
				contentArchPMO +="</div>";
				}				
			if((MESS.PMO7==0)||(MESS.PMO7.length == 0))
				contentArchPMO +='';
			else {
				contentArchPMO +='<div class="repType"><h3>Приборы учёта</h3>';						
				$(MESS.PMO7).each(function(indx, element){
//						console.log(element);
						if(element[0].archieved)
							contentArchPMO += "<div class='message '><span class='activeLink showMess' id='pmo7_"+element[0].sendDate+"'>Отчёт " +  " на " + element[0].sendDate_ru + "</span></div>"; 
						else
							contentArchPMO += "<div class='message redDark'><span class='activeLink showMess doEdit' id='pmo7_"+element[0].sendDate+"'>Отчёт за текущий период (на " + element[0].sendDate_ru + ")</span></div>"; 							
					});
				contentArchPMO +="</div>";
				}			
			if((MESS.PMO8==0)||(MESS.PMO8.length == 0))
				contentArchPMO +='';
			else {
				contentArchPMO +='<div class="repType"><h3>Прочие объекты ЖКХ</h3>';						
				$(MESS.PMO8).each(function(indx, element){
//						console.log(element);
						if(element[0].archieved)
							contentArchPMO += "<div class='message '><span class='activeLink showMess' id='pmo8_"+element[0].sendDate+"'>Отчёт " +  " на " + element[0].sendDate_ru + "</span></div>"; 
						else
							contentArchPMO += "<div class='message redDark'><span class='activeLink showMess doEdit' id='pmo8_"+element[0].sendDate+"'>Отчёт за текущий период (на " + element[0].sendDate_ru + ")</span></div>"; 							
					});
				contentArchPMO +="</div>";
				}										
			if((MESS.PMO9==0)||(MESS.PMO9.length == 0))
				contentArchPMO +='';
			else {
				contentArchPMO +='<div class="repType"><h3>АРИЭ</h3>';						
				$(MESS.PMO9).each(function(indx, element){
//						console.log(element);
						if(element[0].archieved)
							contentArchPMO += "<div class='message '><span class='activeLink showMess' id='pmo9_"+element[0].sendDate+"'>Отчёт " +  " на " + element[0].sendDate_ru + "</span></div>"; 
						else
							contentArchPMO += "<div class='message redDark'><span class='activeLink showMess doEdit' id='pmo9_"+element[0].sendDate+"'>Отчёт за текущий период (на " + element[0].sendDate_ru + ")</span></div>"; 							
					});
				contentArchPMO +="</div>";
				}			
			if((MESS.toplPril1==0)||(MESS.toplPril1.length == 0))
				contentArchTopl +='';
			else {
				contentArchTopl +='<div class="repType"><h3>Отчёты по топливу. Приложение 1 (наличие)</h3>';						
				$(MESS.toplPril1).each(function(indx, element){
						if(element[0].archieved)
							contentArchTopl += "<div class='message '><span class='activeLink showMess' id='toplPril1_"+element[0].sendDate+"'>Отчёт  " +  " на " + element[0].sendDate_ru + "</span></div>"; 
						else
							contentArchTopl += "<div class='message redDark'><span class='activeLink showMess doEdit' id='toplPril1_"+element[0].sendDate+"'>Отчёт за текущий период (на " + element[0].sendDate_ru + ")</span></div>"; 							
					});
				contentArchTopl +="</div>";
				}			
			if((MESS.toplPril2==0)||(MESS.toplPril2.length == 0))
				contentArchTopl +='';
			else {
				contentArchTopl +='<div class="repType"><h3>Отчёты по топливу. Приложение 2 (расход)</h3>';						
				$(MESS.toplPril2).each(function(indx, element){
						if(element[0].archieved)
							contentArchTopl += "<div class='message '><span class='activeLink showMess' id='toplPril2_"+element[0].sendDate+"'>Отчёт  " +  " на " + element[0].sendDate_ru + "</span></div>"; 
						else
							contentArchTopl += "<div class='message redDark'><span class='activeLink showMess doEdit' id='toplPril2_"+element[0].sendDate+"'>Отчёт за текущий период (на " + element[0].sendDate_ru + ")</span></div>"; 							
					});
				contentArchTopl +="</div>";
				}
			if((MESS.SFO==0)||(MESS.SFO.length == 0))
				contentArchStat +='';
			else {
				contentArchStat +='<div class="repType"><h3>Отчёты СФО. Таблица 1</h3>';						
				$(MESS.SFO).each(function(indx, element){
						if(element[0].archieved)
							contentArchStat += "<div class='message '><span class='activeLink showMess' id='SFO#1_"+element[0].sendDate+"'>Отчёт  " +  " на " + element[0].sendDate_ru + "</span></div>"; 
						else
							contentArchStat += "<div class='message redDark'><span class='activeLink showMess doEdit' id='SFO#1_"+element[0].sendDate+"'>Отчёт за текущий период (на " + element[0].sendDate_ru + ")</span></div>"; 							
					});
				contentArchStat +="</div>";
				contentArchStat +='<div class="repType"><h3>Отчёты СФО. Таблица 2</h3>';						
				$(MESS.SFO).each(function(indx, element){
						if(element[0].archieved)
							contentArchStat += "<div class='message '><span class='activeLink showMess' id='SFO#2_"+element[0].sendDate+"'>Отчёт  " +  " на " + element[0].sendDate_ru + "</span></div>"; 
						else
							contentArchStat += "<div class='message redDark'><span class='activeLink showMess doEdit' id='SFO#2_"+element[0].sendDate+"'>Отчёт за текущий период (на " + element[0].sendDate_ru + ")</span></div>"; 							
					});
				contentArchStat +="</div>";
				contentArchStat +='<div class="repType"><h3>Отчёты СФО. Таблица 3</h3>';						
				$(MESS.SFO).each(function(indx, element){
						if(element[0].archieved)
							contentArchStat += "<div class='message '><span class='activeLink showMess' id='SFO#3_"+element[0].sendDate+"'>Отчёт  " +  " на " + element[0].sendDate_ru + "</span></div>"; 
						else
							contentArchStat += "<div class='message redDark'><span class='activeLink showMess doEdit' id='SFO#3_"+element[0].sendDate+"'>Отчёт за текущий период (на " + element[0].sendDate_ru + ")</span></div>"; 							
					});
				contentArchStat +="</div>";
				contentArchStat +='<div class="repType"><h3>Отчёты СФО. Таблица 4</h3>';						
				$(MESS.SFO).each(function(indx, element){
						if(element[0].archieved)
							contentArchStat += "<div class='message '><span class='activeLink showMess' id='SFO#4_"+element[0].sendDate+"'>Отчёт  " +  " на " + element[0].sendDate_ru + "</span></div>"; 
						else
							contentArchStat += "<div class='message redDark'><span class='activeLink showMess doEdit' id='SFO#4_"+element[0].sendDate+"'>Отчёт за текущий период (на " + element[0].sendDate_ru + ")</span></div>"; 							
					});
				contentArchStat +="</div>";
				contentArchStat +='<div class="repType"><h3>Отчёты СФО. Таблица 5</h3>';						
				$(MESS.SFO).each(function(indx, element){
						if(element[0].archieved)
							contentArchStat += "<div class='message '><span class='activeLink showMess' id='SFO#5_"+element[0].sendDate+"'>Отчёт  " +  " на " + element[0].sendDate_ru + "</span></div>"; 
						else
							contentArchStat += "<div class='message redDark'><span class='activeLink showMess doEdit' id='SFO#5_"+element[0].sendDate+"'>Отчёт за текущий период (на " + element[0].sendDate_ru + ")</span></div>"; 							
					});
				contentArchStat +="</div>";
				}
				
			if((MESS.zhkh1==0)||(MESS.zhkh1.length == 0))
				contentArchStat +='';
			else {
				contentArchStat +='<div class="repType"><h3>Отчёты по Форме ЖКХ 1</h3>';						
				$(MESS.zhkh1).each(function(indx, element){
						if(element[0].archieved)
							contentArchStat += "<div class='message '><span class='activeLink showMess' id='zhkh1_"+element[0].sendDate+"'>Отчёт  " +  " на " + element[0].sendDate_ru + "</span></div>"; 
						else
							contentArchStat += "<div class='message redDark'><span class='activeLink showMess doEdit' id='zhkh1_"+element[0].sendDate+"'>Отчёт за текущий период (на " + element[0].sendDate_ru + ")</span></div>"; 							
					});
				contentArchStat +="</div>";
				}
			if((MESS.zhkh2==0)||(MESS.zhkh2.length == 0))
				contentArchStat +='';
			else {
				contentArchStat +='<div class="repType"><h3>Отчёты по Форме ЖКХ 2</h3>';						
				$(MESS.zhkh2).each(function(indx, element){
						if(element[0].archieved)
							contentArchStat += "<div class='message '><span class='activeLink showMess' id='zhkh2_"+element[0].sendDate+"'>Отчёт  " +  " на " + element[0].sendDate_ru + "</span></div>"; 
						else
							contentArchStat += "<div class='message redDark'><span class='activeLink showMess doEdit' id='zhkh2_"+element[0].sendDate+"'>Отчёт за текущий период (на " + element[0].sendDate_ru + ")</span></div>"; 							
					});
				contentArchStat +="</div>";
				}			
			if((MESS.zhkh24==0)||(MESS.zhkh24.length == 0))
				contentArchStat +='';
			else {
				contentArchStat +='<div class="repType"><h3>Отчёты по Форме ЖКХ 2 Приложение 4</h3>';						
				$(MESS.zhkh24).each(function(indx, element){
						if(element[0].archieved)
							contentArchStat += "<div class='message '><span class='activeLink showMess' id='zhkh24_"+element[0].sendDate+"'>Отчёт  " +  " на " + element[0].sendDate_ru + "</span></div>"; 
						else
							contentArchStat += "<div class='message redDark'><span class='activeLink showMess doEdit' id='zhkh24_"+element[0].sendDate+"'>Отчёт за текущий период (на " + element[0].sendDate_ru + ")</span></div>"; 							
					});
				contentArchStat +="</div>";
				}
			if((MESS.zhkh3==0)||(MESS.zhkh3.length == 0))
				contentArchStat +='';
			else {
				contentArchStat +='<div class="repType"><h3>Отчёты по Форме ЖКХ 3</h3>';						
				$(MESS.zhkh3).each(function(indx, element){
						if(element[0].archieved)
							contentArchStat += "<div class='message '><span class='activeLink showMess' id='zhkh3_"+element[0].sendDate+"'>Отчёт  " +  " на " + element[0].sendDate_ru + "</span></div>"; 
						else
							contentArchStat += "<div class='message redDark'><span class='activeLink showMess doEdit' id='zhkh3_"+element[0].sendDate+"'>Отчёт за текущий период (на " + element[0].sendDate_ru + ")</span></div>"; 							
					});
				contentArchStat +="</div>";
				}			
		content +="</div><div class='repList'>";
		if(contentArchPMO != '')
			contentArch +="<h2 style='clear: both;	margin-bottom: 10px;'>Паспорт МО</h2><div>"  + contentArchPMO + "</div>";
		if(contentArchTopl != '')
			contentArch +="<h2 style='clear: both;	margin-bottom: 10px;'>Наличие и расход топлива</h2><div>"  + contentArchTopl + "</div>";
		if(contentArchStat != '')
			contentArch +="<h2 style='clear: both;	margin-bottom: 10px;'>Статистическая отчётность</h2><div>"  + contentArchStat + "</div>";
		if(contentArch != '')
			content +="<h1>Архив отчётов</h1><div class='' style='margin: 5px 0px 15px 0px;'>"  + contentArch;								
		content +="</div></div>";
		$("#mainList").html(content);
		$('.activeButton').on('click', function (event) {
			var nextPage = 'formContaner';
			var activePage = 1;
			formName = event.currentTarget.id; 
			var editRep = 0;
			var repId = '';
			switch(formName){
				case '1zhkh':{				
					if(MESS.zhkh1 != undefined){
						$(MESS.zhkh1).each(function(indx, element){
							if(!element[0].archieved){
								editRep ++;
								repId = element[0].sendDate;
							}
						});					
					}
				}break;
				case 'zhkh2':{				
					if(MESS.zhkh2 != undefined){
						$(MESS.zhkh2).each(function(indx, element){
							if(!element[0].archieved){
								editRep ++;
								repId = element[0].sendDate;
							}
						});					
					}
				}break;
				case 'zhkh24':{				
					if(MESS.zhkh24 != undefined){
						$(MESS.zhkh24).each(function(indx, element){
							if(!element[0].archieved){
								editRep ++;
								repId = element[0].sendDate;
							}
						});					
					}
				}break;				
				case 'zhkh3':{				
					if(MESS.zhkh3 != undefined){
						$(MESS.zhkh3).each(function(indx, element){
							if(!element[0].archieved){
								editRep ++;
								repId = element[0].sendDate;
							}
						});					
					}
				}break;
				case 'toplPril2':{				
					if(MESS.toplPril2 != undefined){
						$(MESS.toplPril2).each(function(indx, element){
							if(!element[0].archieved){
								editRep ++;
								repId = element[0].sendDate;
							}
						});					
					}
				}break; 
				case 'toplPril1':{				
					if(MESS.toplPril1 != undefined){
						$(MESS.toplPril1).each(function(indx, element){
							if(!element[0].archieved){
								editRep ++;
								repId = element[0].sendDate;
							}
						});					
					}
				}break;
				case 'pmo_1':{						
					if(MESS.PMO1 != undefined){
						$(MESS.PMO1).each(function(indx, element){
							if(!element[0].archieved){
								editRep ++;
								repId = element[0].sendDate;
							}
						});					
					}
/*					nextPage = 'objListContaner';
					activePage = 3;*/
				}break;						
				case 'pmo_3':{
					if(MESS.PMO3 != undefined){
						$(MESS.PMO3).each(function(indx, element){
							if(!element[0].archieved){
								editRep ++;
								repId = element[0].sendDate;
							}
						});					
					}
				}break;				
				case 'pmo_4':{
					if(MESS.PMO4 != undefined){
						$(MESS.PMO4).each(function(indx, element){
							if(!element[0].archieved){
								editRep ++;
								repId = element[0].sendDate;
							}
						});					
					}
				}break;				
				case 'pmo_5':{
					if(MESS.PMO5 != undefined){
						$(MESS.PMO5).each(function(indx, element){
							if(!element[0].archieved){
								editRep ++;
								repId = element[0].sendDate;
							}
						});					
					}
				}break;				
				case 'pmo_7':{
					if(MESS.PMO7 != undefined){
						$(MESS.PMO7).each(function(indx, element){
							if(!element[0].archieved){
								editRep ++;
								repId = element[0].sendDate;
							}
						});					
					}
				}break;				
				case 'pmo_8':{
					if(MESS.PMO8 != undefined){
						$(MESS.PMO8).each(function(indx, element){
							if(!element[0].archieved){
								editRep ++;
								repId = element[0].sendDate;
							}
						});					
					}
				}break;				
				case 'pmo_9':{
					if(MESS.PMO9 != undefined){
						$(MESS.PMO9).each(function(indx, element){
							if(!element[0].archieved){
								editRep ++;
								repId = element[0].sendDate;
							}
						});					
					}
				}break;				
				case 'pmo2':{	
					/*
					if(MESS.toplPril1 != undefined){
						$(MESS.toplPril1).each(function(indx, element){
							if(!element[0].archieved){
								editRep ++;
								repId = element[0].sendDate;
							}
						});					
					}*/
					nextPage = 'objListContaner';
					activePage = 3;
				}break;				
				case 'pmo_6':{	
				}
				case 'pmo6':{	
					/*
					if(MESS.toplPril1 != undefined){
						$(MESS.toplPril1).each(function(indx, element){
							if(!element[0].archieved){
								editRep ++;
								repId = element[0].sendDate;
							}
						});					
					}*/
					nextPage = 'objListContaner';
					activePage = 3;
				}break;
				default : {};
			}
			if(editRep){
				cloneMessId = repId; 
				doEdit = true; 
			}
			$( "#tabs" ).tabs( "enable", "#" + nextPage); 
			$("#tabs").tabs( "option", "active", activePage ); 			
		}) ;
		$(".showMess").on('click', function (event) { 
			var strArr1 = event.currentTarget.id.split('_'); 
			var tableIndex = '';
			if (strArr1[0].indexOf('SFO') >= 0 ){
				tableIndex = ROUT.GetStrPrt(strArr1[0], '#', 1);
				var multyTableName = ROUT.GetStrPrt(strArr1[0], '#', 0);
				tIndex = tableIndex;

				formName = 'sfo_' + tIndex;
			}
			console.log(event.currentTarget);
			if(event.currentTarget.className.indexOf('doEdit')>=0){
				event.stopPropagation();	
				cloneMessId = strArr1[1]; 
				doEdit = true; 
				//console.log('cloneMessId is ' + cloneMessId);
				//console.log('cloneMessType is ' + formType);
				if(tableIndex == '')
					formName = strArr1[0]; 
				console.log(formName, tableIndex, tIndex);
				$("#tabs" ).tabs( "enable", "#formContaner" );
				$("#tabs").tabs( "option", "active", 1 ); 
			} else	{		
				let repName = (tableIndex == '') ? strArr1[0] : multyTableName;
				
				FORM.showMessAdm(repName, strArr1[1], (tableIndex == '') ? 0 :  tableIndex);
			}
		});
		});
//		}, 500);

	}	

	this.mesgList = function(lId){
		var layer = ULayers[ULayerIndex[lId]];	
		UI.toggleLockingPad();
		UI.toCenter('formBox');	
		UI.togglePanel('', 'formBox', 1, '');
		$('#formBox_title_text').text('Журнал оперативных донесений. ' + layer.name);
		$('#formSubmit').text(' Закрыть ');
		$('#formSubmit').on('click', function (event) {$('#closePanelImg').trigger('click');});		
		$("#mainForm ").html('');
		$("#mainForm ").hide('');
		var content = '';
		$(layer.message).each(function(indx, element){
			content += "<div class='message '><span class='activeLink'>Донесение №"+ (indx+1) + " </span></div>"; //+ element.
		});
		$("#mainList").html(content);
		$("#mainList").show('');
//		$("#formSubmit").css('display:none');
		
		console.log(layer);
//		alert(lId);
	}


	this.getElements = function(type, repId=0){
		//var key = 'cell_50';
		var clone = {};
		var arr=[], arrName = '';
		var elements1 = {"action" : "index.html",
						"method" : "get",
						"html" :[
							{
								"name" : "frm_type",
								"id" : "frm_type",
								"type" : "hidden",
								"value" :  type								
							},
							{
								"name" : "frm_userId",
								"id" : "frm_userId",
								"type" : "hidden",
								"value" :  userId								
							},
							{
								"name" : "frm_distId",
								"id" : "frm_distId",
								"type" : "hidden",
								"value" :  homeDistr.id								
							},
							{
								"name" : "frm_distName",
								"id" : "frm_distName",
								"type" : "hidden",
								"value" :  homeDistr.name								
							}
							]};
		console.log(arguments);
		switch(type){
			case 'sfo_1' :{
				if(arrName == ''){arrName = 'sfoField_1', arr = sfoField_1;}
				};
			case 'sfo_2' :{
				if(arrName == ''){arrName = 'sfoField_2', arr = sfoField_2;}
				};
			case 'sfo_3' :{
				if(arrName == ''){arrName = 'sfoField_3', arr = sfoField_3;}
				};
			case 'sfo_4' :{
				if(arrName == ''){arrName = 'sfoField_4', arr = sfoField_4;}
				};
			case 'sfo_5' :{
//				console.log(type, arr.length, arr);
				if (arrName == ''){arrName = 'sfoField_4', arr = sfoField_5;}
				if(repId>0){
					console.log(repId);
					$(MESS.SFO).each(function(indx, element){
						if(element[0].sendDate == repId){
							clone = element[0];
						}
					});					
				}
				console.log();
//				var arr = sfoField_1;
				var cnt = 0;
				var placeHolder = 'Значение'; var caption = '';
				for (key in arr){
//					var placeHolder = '';
					if(ROUT.is_string(arr[key])){
						caption = ROUT.str_replace( '(', '<span class="hilight_2">', ROUT.str_replace( '[', '<span class="hilight_1">', ROUT.str_replace( ')', '</span>', ROUT.str_replace( ']', '</span>', arr[key] ))));
						if(repId>0) console.log(key, clone.key, clone[key]);
						elements1.html.push({
							"name" : key,
							"id" : key,
							"caption" : caption,
							"placeholder" : placeHolder,
							"class" : ' maskFloat ',
							"type" : "text",
							"value" : (repId>0)?clone[key]:""//Math.random()*100
						});
						cnt ++;
						}
					}


			} break;
			case 'toplPril1' :{
				if(repId>0){
					console.log(repId);
					$(MESS.toplPril1).each(function(indx, element){
						if(element[0].sendDate == repId){
							clone = element;
						}
					});					
				}
				var arr = toplPril1Field;
				var cnt = 0;
				var placeHolder = 'Значение'; var caption = '';
							console.log('clone is');
							console.log(clone);
				for (key in arr){
					/*switch(toplPril1Format[cnt]){
						case 'i' : {placeHolder = '10'} break;
						case 'f' : {placeHolder = '10.25'} break;
						case 't' : {placeHolder = 'ФИО'} break;
					}*/
//					var placeHolder = '';
					if(ROUT.is_string(arr[key])){
						caption = ROUT.str_replace( '(', '<span class="hilight_2">', ROUT.str_replace( '[', '<span class="hilight_1">', ROUT.str_replace( ')', '</span>', ROUT.str_replace( ']', '</span>', arr[key] ))));
//						caption = ROUT.str_replace( '(', '', ROUT.str_replace( '[', '', ROUT.str_replace( ')', '', ROUT.str_replace( ']', '', arr[key] ))));
//						caption = arr[key];
//						if(repId>0) console.log(key, clone.key, clone[key]);
						let className= (cnt<22)? ' maskFloat ' : ' ';
						elements1.html.push({
							"name" : key,
							"id" : key,
							"caption" : caption,
							"placeholder" : placeHolder,
							"class" : className,
							"type" : "text",
//							"value" : (repId>0)?clone[key]:""//Math.random()*1000//""
							"value" : (repId>0)?clone[0][key]:""//Math.random()*1000//"" //Math.random()*1000
					});
						cnt ++;
						}
					}


			} break;
			case '1zhkh' :{};
			case 'zhkh1' :{
				if(repId>0){
					console.log(repId);
					$(MESS.zhkh1).each(function(indx, element){
						if(element[0].sendDate == repId){
							clone = element;
						}
					});					
				}
				console.log('clone is');
				console.log(clone);
				var arr = zhkh1Field;
				var placeHolder = 'Значение'; var caption = '';
				var cnt = 0;
						elements1.html.push({
							"type" : "div",
							"class" : "rowHeaderStart",
							"html" : ""
						});
						elements1.html.push({
							"type" : "div",
							"class" : "rowHeader",
							"html" : "всего"
						});
						elements1.html.push({
							"type" : "div",
							"class" : "rowHeader",
							"html" : "план года"
						});
						elements1.html.push({
							"type" : "div",
							"class" : "rowHeader",
							"html" : "факт"
						});
						elements1.html.push({
							"type" : "div",
							"class" : "rowHeader",
							"html" : "кап.рем., реконстр."
						});
						elements1.html.push({
							"type" : "div",
							"class" : "rowEnd"
						});
				for (key in arr){
					if(ROUT.is_string(arr[key])){
						caption = ROUT.str_replace( '(', '<span class="hilight_2">', ROUT.str_replace( '[', '<span class="hilight_1">', ROUT.str_replace( ')', '</span>', ROUT.str_replace( ']', '</span>', arr[key] ))));

						elements1.html.push({
							"type" : "div",
							"class" : "rowNum",
							"html" : (cnt+1)
						});
						elements1.html.push({
							"name" : key + "_1",
							"id" : key + "_1",
							"caption" : caption,
							"placeholder" : placeHolder,
							"type" : "text",
							"title" : "всего",
							"class" : "rowCell rowStart maskFloat",
							"value" : (repId>0)?clone[0][key]:"" //Math.random()*1000
						});
						elements1.html.push({
							"name" : key + "_2",
							"id" : key + "_2",
	//						"caption" : "",
							"placeholder" : placeHolder,
							"type" : "text",
							"title" : "план года",
							"class" : "rowCell maskFloat",
							"value" : (repId>0)?clone[1][key]:""
						});
						elements1.html.push({
							"name" : key + "_3",
							"id" : key + "_3",
	//						"caption" : "",
							"placeholder" : placeHolder,
							"type" : "text",
							"title" : "факт",
							"class" : "rowCell maskFloat",
							"value" : (repId>0)?clone[2][key]:""
						});
						elements1.html.push({
							"name" : key + "_4",
							"id" : key + "_4",
	//						"caption" : "",
							"placeholder" : placeHolder,
							"type" : "text",
							"title" : "кап.рем., реконстр.",
							"class" : "rowCell maskFloat",
							"value" : (repId>0)?clone[3][key]:""
						});
						elements1.html.push({
							"type" : "div",
							"class" : "rowEnd"
						});
						cnt ++;
						}
					}				
			}	break;		
			case 'zhkh3' :{
				if(repId>0){
					console.log(repId);
					$(MESS.zhkh3).each(function(indx, element){
						if(element[0].sendDate == repId){
							clone = element;
						}
					});					
				}
/*				console.log('clone is');
				console.log(clone);
/*				console.log(zhkh3Field);*/
				var arr = zhkh3Field;
				var placeHolder = 'Значение'; var caption = '';
				var cnt = 0;
						elements1.html.push({
							"type" : "div",
							"class" : "rowHeaderStart",
							"html" : ""
						});
						elements1.html.push({
							"type" : "div",
							"class" : "rowHeader",
							"html" : "Фактически поставлено с начала отопительного сезона"
						});
						elements1.html.push({
							"type" : "div",
							"class" : "rowHeader",
							"html" : "Фактически израсходовано с начала отопительного сезона"
						});
						elements1.html.push({
							"type" : "div",
							"class" : "rowHeader",
							"html" : "Объемы запасов топлива на конец отчетного периода"
						});
						elements1.html.push({
							"type" : "div",
							"class" : "rowHeader",
							"html" : "Объем договорных обязательств по поставкам топлива"
						});
						elements1.html.push({
							"type" : "div",
							"class" : "rowHeader",
							"html" : "Объем поставок местного топлива"
						});
						elements1.html.push({
							"type" : "div",
							"class" : "rowHeader",
							"html" : "Среднесложившаяся по договорам стоимость топлива"
						});
						elements1.html.push({
							"type" : "div",
							"class" : "rowHeader",
							"html" : "Задолженность за ранее потребленные ТЭР, млн.руб."
						});
						elements1.html.push({
							"type" : "div",
							"class" : "rowEnd"
						});
//				arr.forEach(function(key, indx, arr){	
				for (key in arr){	
//					console.log(arr[key]);
					if(ROUT.is_string(arr[key].label)){
						caption = ROUT.str_replace( '(', '<span class="hilight_2">', ROUT.str_replace( '[', '<span class="hilight_1">', ROUT.str_replace( ')', '</span>', ROUT.str_replace( ']', '</span>', arr[key].label ))));

						elements1.html.push({
							"type" : "div",
							"class" : "rowNum",
							"html" : (cnt+1)
						});
						elements1.html.push({
							"name" : key + "_1",
							"id" : key + "_1",
							"caption" : caption,
							"placeholder" : placeHolder,
							"type" : "text",
							"title" : "Фактически поставлено с начала отопительного сезона",
							"class" : "rowCell rowStart maskFloat",
							"value" : (repId>0)?clone[0][key]:"" //Math.random()*1000
						});
						elements1.html.push({
							"name" : key + "_2",
							"id" : key + "_2",
	//						"caption" : "",
							"placeholder" : placeHolder,
							"type" : "text",
							"title" : "Фактически израсходовано с начала отопительного сезона",
							"class" : "rowCell maskFloat",
							"value" : (repId>0)?clone[1][key]:""//Math.random()*1000//""
						});
						elements1.html.push({
							"name" : key + "_3",
							"id" : key + "_3",
	//						"caption" : "",
							"placeholder" : placeHolder,
							"type" : "text",
							"title" : "Объемы запасов топлива на конец отчетного периода",
							"class" : "rowCell maskFloat",
							"value" : (repId>0)?clone[2][key]:""//Math.random()*1000//""
						});
						elements1.html.push({
							"name" : key + "_4",
							"id" : key + "_4",
	//						"caption" : "",
							"placeholder" : placeHolder,
							"type" : "text",
							"title" : "Объем договорных обязательств по поставкам топлива",
							"class" : "rowCell maskFloat",
							"value" : (repId>0)?clone[3][key]:""//Math.random()*1000//""
						});
						elements1.html.push({
							"name" : key + "_5",
							"id" : key + "_5",
	//						"caption" : "",
							"placeholder" : placeHolder,
							"type" : "text",
							"title" : "Объем поставок местного топлива",
							"class" : "rowCell maskFloat",
							"value" : (repId>0)?clone[4][key]:""//Math.random()*1000//""
						});
						elements1.html.push({
							"name" : key + "_6",
							"id" : key + "_6",
	//						"caption" : "",
							"placeholder" : placeHolder,
							"type" : "text",
							"title" : "Среднесложившаяся по договорам стоимость топлива",
							"class" : "rowCell maskFloat",
							"value" : (repId>0)?clone[5][key]:""//Math.random()*1000//""
						});
						elements1.html.push({
							"name" : key + "_7",
							"id" : key + "_7",
	//						"caption" : "",
							"placeholder" : placeHolder,
							"type" : "text",
							"title" : "Задолженность за ранее потребленные ТЭР, млн.руб.",
							"class" : "rowCell maskFloat",
							"value" : ((repId>0)&&(clone[6]!=undefined))?clone[6][key]:""//Math.random()*1000//""
						});
						elements1.html.push({
							"type" : "div",
							"class" : "rowEnd"
						});
						cnt ++;
						}
					}				
			} break;
			case 'zhkh2' :{
				if(repId>0){
					console.log(repId);
					$(MESS.zhkh2).each(function(indx, element){
						if(element[0].sendDate == repId){
							clone = element;
						}
					});					
				}
				console.log('clone is');
				console.log(clone);
/*				console.log(zhkh3Field);*/
				var arrH = zhkh2Field;
				var arrF = zhkh2Head;
				var placeHolder = 'Значение'; var caption = '';
				var cnt = 0;
						elements1.html.push({
							"type" : "div",
							"class" : "rowHeaderStart",
							"html" : ""
						});
						for (key in arrH){	
		//					console.log(arr[key]);
							if(ROUT.is_string(arrH[key].label)){
								elements1.html.push({
									"type" : "div",
									"class" : "rowHeader",
									"html" : arrH[key].label
								});
								
							}
						}

						elements1.html.push({
							"type" : "div",
							"class" : "rowEnd"
						});
//				arr.forEach(function(key, indx, arr){	
				for (key in arrF){	
//					console.log(arr[key]);
					if(ROUT.is_string(arrF[key].label)){
						caption = ROUT.str_replace( '(', '<span class="hilight_2">', ROUT.str_replace( '[', '<span class="hilight_1">', ROUT.str_replace( ')', '</span>', ROUT.str_replace( ']', '</span>', arrF[key].label ))));

						elements1.html.push({
							"type" : "div",
							"class" : "rowNum",
							"html" : (cnt+1)
						});
						elements1.html.push({
							"name" : "cell_1_" + key,
							"id" :  "cell_1_" + key,
							"caption" : caption,
							"placeholder" : placeHolder,
							"type" : "text",
							"title" : "Фактически поставлено с начала отопительного сезона",
							"class" : "rowCell2 rowStart maskFloat",
							"value" : (repId>0)?clone[key-1]['cell_1']:""//Math.random()*1000//"" //Math.random()*1000
						});
						var count= 0;
						for (key1 in arrH){	
							if(count){
							elements1.html.push({
								"name" : key1 + "_" + key ,
								"id" : key1 + "_" + key,
		//						"caption" : "",
								"placeholder" : placeHolder,
								"type" : "text",
								"title" : arrH[key1].label,
								"class" : "rowCell2 maskFloat",								
								"value" : (repId>0)?clone[key-1][key1]:""//Math.random()*1000//""
							});} 
							count ++;
						}
						elements1.html.push({
							"type" : "div",
							"class" : "rowEnd"
						});
						cnt ++;
						}
					}				
				} break;
			case 'zhkh24' :{
				if(repId>0){
					console.log(repId);
					$(MESS.zhkh24).each(function(indx, element){
						if(element[0].sendDate == repId){
							clone = element;
						}
					});					
				}
				console.log('clone is');
				console.log(clone);
				var arr = zhkh24Field;
				var placeHolder = 'Значение'; var caption = '';
				var cnt = 0;
				for (key in arr){	
					console.log(key);
					console.log(arr[key]);
					if(ROUT.is_string(arr[key].label)){
						caption = ROUT.str_replace( '(', '<span class="hilight_2">', ROUT.str_replace( '[', '<span class="hilight_1">', ROUT.str_replace( ')', '</span>', ROUT.str_replace( ']', '</span>', arr[key].label ))));

						elements1.html.push({
							"type" : "div",
							"class" : "rowNum",
							"html" : (cnt+1)
						});
						elements1.html.push({
							"name" : "cell_1" + "_" + key,
							"id" :   "cell_1" + "_" +key,
							"caption" : caption,
							"placeholder" : placeHolder,
							"type" : "text",
							"class" : "rowCell2 rowStart maskFloat",
							"value" : ((repId>0)&&(clone[key-1] != undefined))?clone[key-1]['cell_1']:""//Math.random()*1000//"" //Math.random()*1000
						});

						elements1.html.push({
							"type" : "div",
							"class" : "rowEnd"
						});
						cnt ++;
						}
					}				
				} break;
			case 'toplPril2' :{
				if(repId>0){
					console.log(repId);
					$(MESS.toplPril2).each(function(indx, element){
						if(element[0].sendDate == repId){
							clone = element;
						}
					});					
				console.log('clone is');
				console.log(clone);
				}
				var arr = tPr2Field;
				var placeHolder = 'Значение'; var caption = '';
				var cnt = 0;
						elements1.html.push({
							"type" : "div",
							"class" : "rowHeaderStart",
							"html" : ""
						});
						for (key in tPr2Head){	
		//					console.log(arr[key]);
							if(ROUT.is_string(tPr2Head[key].label)){
								elements1.html.push({
									"type" : "div",
									"class" : "rowHeader",
									"html" : tPr2Head[key].label
								});
								
							}
						}

						elements1.html.push({
							"type" : "div",
							"class" : "rowEnd"
						});
				for (key in arr){	
//					console.log(arr[key]);
					if(ROUT.is_string(arr[key].label)){
						caption = ROUT.str_replace( '(', '<span class="hilight_2">', ROUT.str_replace( '[', '<span class="hilight_1">', ROUT.str_replace( ')', '</span>', ROUT.str_replace( ']', '</span>', arr[key].label ))));

						elements1.html.push({
							"type" : "div",
							"class" : "rowNum",
							"html" : (cnt+1)
						});
						elements1.html.push({
							"name" : key + "_"+"1",
							"id" :  key + "_"+"1",
							"caption" : caption,
							"placeholder" : placeHolder,
							"type" : "text",
							"title" : "Уголь, т",
							"class" : "rowCell3 rowStart  maskFloat",
							"value" : (repId>0)?clone[0][key]:""//Math.random()*1000//"" //Math.random()*1000
						});
						var count= 0;
						for (key1 in tPr2Head){
							if(count){
							elements1.html.push({
								"name" : key + "_" + key1,
								"id" : key + "_" + key1,
		//						"caption" : "",
								"placeholder" : placeHolder,
								"type" : "text",
								"title" : tPr2Head[key1].label,
								"class" : "rowCell3  maskFloat",								
								"value" : (repId>0)?clone[count][key]:""//Math.random()*1000//""
							});} 
							count ++;
						}
						elements1.html.push({
							"type" : "div",
							"class" : "rowEnd"
						});
						cnt ++;
						}
					}				
			} break;
			case 'pmo_1' :{
			};
			case 'pmo1' :{
				if(repId>0){
//					console.log(repId);
					$(MESS.PMO1).each(function(indx, element){
						if(element[0].sendDate == repId){
							clone = element;
						}
					});					
				}
				var arr = pmo1Field;
				var placeHolder = 'Значение'; var caption = '';
				var cnt = 0;
						elements1.html.push({
							"type" : "div",
							"class" : "rowHeaderStart",
							"html" : ""
						});
						elements1.html.push({
									"type" : "div",
									"class" : "rowHeader150",
									"html" : "Жилищный фонд всего"
								});						
						elements1.html.push({
									"type" : "div",
									"class" : "rowHeader150",
									"html" : "Жилищный фонд подключенный к централизованному теплоснабжению"
								});						
						elements1.html.push({
							"type" : "div",
							"class" : "rowEnd"
						});
//				arr.forEach(function(key, indx, arr){	
				for (key in arr){	
//					console.log(arr[key]);
					if(ROUT.is_string(arr[key].label)){
						caption = ROUT.str_replace( '(', '<span class="hilight_2">', ROUT.str_replace( '[', '<span class="hilight_1">', ROUT.str_replace( ')', '</span>', ROUT.str_replace( ']', '</span>', arr[key].label ))));

						elements1.html.push({
							"type" : "div",
							"class" : "rowNum",
							"html" : (cnt+1)
						});
						elements1.html.push({
							"name" : key + "_" + "1" ,
							"id" :   key + "_" + "1" ,
							"caption" : caption,
							"placeholder" : placeHolder,
							"title": "Жилищный фонд всего",
							"type" : "text",
							"class" : "rowCell150 rowStart maskFloat",
							"value" : (repId>0)?clone[0][key]:""//Math.random()*1000//"" //Math.random()*1000
						});
						elements1.html.push({
							"name" : key + "_" + "2" ,
							"id" :   key + "_" + "2" ,
							"placeholder" : placeHolder,
							"title": "Жилищный фонд подключенный к централизованному теплоснабжению",
							"type" : "text",
							"class" : "rowCell150 maskFloat",
							"value" : (repId>0)?clone[1][key]:""//Math.random()*1000//"" //Math.random()*1000
						});

						elements1.html.push({
							"type" : "div",
							"class" : "rowEnd"
						});
						cnt ++;
						}
					}				
				} break;			
			case 'pmo2' :{
				if(repId>0){
//					console.log(repId);
					$(MESS.PMO2).each(function(indx, element){
						if(element.id == repId){
							clone = element;
						}
					});	
					elements1.html.push({
						"name" : "recId",
						"id" : "recId",
						"type" : "hidden",
						"value" :  clone.id								
					});					
				} else {
					elements1.html.push({
						"name" : "recId",
						"id" : "recId",
						"type" : "hidden",
						"value" :  "0"								
					});										
				}
				var arr = pmo2Field;
				var placeHolder = 'Значение'; var caption = '';
				var cnt = 0;
				for (key in arr){
//					console.log(arr[key]);
					
					if(ROUT.is_string(arr[key].label)){
						caption = ROUT.str_replace( '(', '<span class="hilight_2">', ROUT.str_replace( '[', '<span class="hilight_1">', ROUT.str_replace( ')', '</span>', ROUT.str_replace( ']', '</span>', arr[key].label ))));
						let classAdd = (arr[key].type == 'f') ? ' maskFloat ' : ' ';
						elements1.html.push({
							"type" : "div",
							"class" : "rowNum",
							"html" : (cnt+1)
						});
						if(arr[key].type != 'b'){
							elements1.html.push({
								"name" : key + '_'+arr[key].type ,
								"id" :   key + '_'+arr[key].type,
								"caption" : caption,
								"placeholder" : placeHolder,
								"title": "значение",
								"type" : "text",
								"class" : "rowStart rowcell4 " + classAdd,
	//							"value" : (repId>0)?clone[0][key]:Math.random()*1000//"" //Math.random()*1000
								"value" : (repId>0)?clone[key]:"" 
							});
						} else {
							if(repId>0){
								if(arr[key].options != undefined){
									for (el in arr[key].options){
										if(el ==  clone[key]){
											arr[key].options[el] = {"selected" : "selected","html" : el};
//											console.log(el, clone[key], arr[key].options[el]);
										}
									}
								}
							}
							var boolEl= {
								"name" : key + '_'+arr[key].type ,
								"id" :   key + '_'+arr[key].type,
								"caption" : caption,
								"class" : "rowStart rowcell4 ",
								"type" : "select",
								"options" : arr[key].options
							};							
							elements1.html.push(boolEl);
						}
						elements1.html.push({
							"type" : "div",
							"class" : "rowEnd"
						});
						cnt ++;
						}
					}				
				
				} break;			
			case 'pmo_3' :{
			}
			case 'pmo3' :{
				if(repId>0){
					console.log(repId);
					$(MESS.PMO3).each(function(indx, element){
						if(element[0].sendDate == repId){
							clone = element;
						}
					});					
				}
				var arr = pmo3Head;
				var placeHolder = 'Значение'; var caption = '';
				var cnt = 0;

						elements1.html.push({
									"type" : "div",
									"class" : "rowHeaderSingle",
									"html" : "Общая протяженность тепловых сетей в 2-х трубном исчислении"
								});						
						
						elements1.html.push({
							"type" : "div",
							"class" : "rowHeaderStart",
							"html" : ""
						});
						for (key in pmo3Field){
						elements1.html.push({
									"type" : "div",
									"class" : "rowHeader",
//									"html" : pmo3Field[key].label
									"html" : ROUT.str_replace( '(', '<span class="hilight_2">', ROUT.str_replace( '[', '<span class="hilight_1">', ROUT.str_replace( ')', '</span>', ROUT.str_replace( ']', '</span>', pmo3Field[key].label ))))
								});		
						}
					
						elements1.html.push({
							"type" : "div",
							"class" : "rowEnd"
						});
//				arr.forEach(function(key, indx, arr){	
				for (key in arr){	
					if(ROUT.is_string(arr[key].label)){
						console.log(key);
						caption = ROUT.str_replace( '(', '<span class="hilight_2">', ROUT.str_replace( '[', '<span class="hilight_1">', ROUT.str_replace( ')', '</span>', ROUT.str_replace( ']', '</span>', arr[key].label ))));

						elements1.html.push({
							"type" : "div",
							"class" : "rowNum",
							"html" : (cnt+1)
						});
						var count= 0;
						for (key1 in pmo3Field){
							if(count){
							let cellIndex = (count + 1);
							elements1.html.push({
								"name" : key1 + "_" + key,
								"id" : key1 + "_" + key,
		//						"caption" : "",
								"placeholder" : placeHolder,
								"type" : "text",
								"title" : pmo3Field[key1].label,
								"class" : "rowCell maskFloat",								
								"value" : (repId>0)?clone[key-1]['cell_' + cellIndex]:""//Math.random()*1000//""
							});} else {
							elements1.html.push({
								"name" : key1 + "_" + key ,
								"id" :   key1 + "_" + key ,
								"caption" : caption,
								"placeholder" : placeHolder,
								"title": pmo3Field['cell_1'].label,
								"type" : "text",
								"class" : "rowCell rowStart  maskFloat",
								"value" : (repId>0)?clone[key-1]['cell_1']:""//Math.random()*1000//"" //Math.random()*1000
							});								
							}
							count ++;
						}

						elements1.html.push({
							"type" : "div",
							"class" : "rowEnd"
						});
						cnt ++;
						}
					}				
				} break;			
			case 'pmo4' :{
			};
			case 'pmo_4' :{
				if(repId>0){
					console.log(repId);
					$(MESS.PMO4).each(function(indx, element){
						if(element[0].sendDate == repId){
							clone = element;
						}
					});					
				}
				var arr = pmo4Field;
				var placeHolder = 'Значение'; var caption = '';
				var cnt = 0;

						elements1.html.push({
							"type" : "div",
							"class" : "rowHeaderStart",
							"html" : ""
						});
						for (key in pmo4Head){
						elements1.html.push({
									"type" : "div",
									"class" : "rowHeader",
//									"html" : pmo3Field[key].label
									"html" : ROUT.str_replace( '(', '<span class="hilight_2">', ROUT.str_replace( '[', '<span class="hilight_1">', ROUT.str_replace( ')', '</span>', ROUT.str_replace( ']', '</span>', pmo4Head[key].label ))))
								});		
						}
					
						elements1.html.push({
							"type" : "div",
							"class" : "rowEnd"
						});
//				arr.forEach(function(key, indx, arr){	
				for (key in arr){	
//					console.log(arr[key]);
					if(ROUT.is_string(arr[key].label)){
						caption = ROUT.str_replace( '(', '<span class="hilight_2">', ROUT.str_replace( '[', '<span class="hilight_1">', ROUT.str_replace( ')', '</span>', ROUT.str_replace( ']', '</span>', arr[key].label ))));

						elements1.html.push({
							"type" : "div",
							"class" : "rowNum",
							"html" : (cnt+1)
						});
						var count= 0;
						for (key1 in pmo4Head){	
							if(count){
								elements1.html.push({
									"name" : key + "_" + key1,
									"id" : key + "_" + key1,
									"placeholder" : placeHolder,
									"type" : "text",
									"title" : pmo4Head[key1].title,
									"class" : "rowcell2 maskFloat",								
									"value" : (repId>0)?clone[count][key]:""//Math.random()*1000//""
							});

							} else {
								elements1.html.push({
									"name" : key + "_" + key1 ,
									"id" :   key + "_" + key1 ,
									"caption" : caption,
									"placeholder" : placeHolder,
									"title": pmo4Head[1].title,
									"type" : "text",
									"class" : "rowcell2 rowStart maskFloat",
									"value" : (repId>0)?clone[count][key]:""//Math.random()*1000//"" //Math.random()*1000
								});
							}								
							count ++;
						}
						elements1.html.push({
							"type" : "div",
							"class" : "rowEnd"
						});
						cnt ++;
						}
					}				
				} break;			
			case 'pmo5' :{
			}
			case 'pmo_5' :{
				if(repId>0){
					console.log(repId);
					$(MESS.PMO5).each(function(indx, element){
						if(element[0].sendDate == repId){
							clone = element;
						}
					});					
				}

				var arr = pmo5Field;
				var placeHolder = 'Значение'; var caption = '';
				var cnt = 0;
						elements1.html.push({
							"type" : "div",
							"class" : "rowHeaderStart",
							"html" : ""
						});
						elements1.html.push({
									"type" : "div",
									"class" : "rowHeader",
									"html" : "Муниципальные"
								});						
						elements1.html.push({
									"type" : "div",
									"class" : "rowHeader",
									"html" : "Ведомственные"
								});						
						elements1.html.push({
									"type" : "div",
									"class" : "rowHeader",
									"html" : "Частные"
								});						
						elements1.html.push({
							"type" : "div",
							"class" : "rowEnd"
						});
//				arr.forEach(function(key, indx, arr){	
				for (key in arr){	
//					console.log(arr[key]);
					if(ROUT.is_string(arr[key].label)){
						caption = ROUT.str_replace( '(', '<span class="hilight_2">', ROUT.str_replace( '[', '<span class="hilight_1">', ROUT.str_replace( ')', '</span>', ROUT.str_replace( ']', '</span>', arr[key].label ))));

						elements1.html.push({
							"type" : "div",
							"class" : "rowNum",
							"html" : (cnt+1)
						});
						elements1.html.push({
							"name" : key + "_" + "1" ,
							"id" :   key + "_" + "1" ,
							"caption" : caption,
							"placeholder" : placeHolder,
							"title": "Муниципальные",
							"type" : "text",
							"class" : "rowCell rowStart maskFloat",
							"value" : (repId>0)?clone[0][key]:""//Math.random()*1000//"" //Math.random()*1000
						});
						elements1.html.push({
							"name" : key + "_" + "2" ,
							"id" :   key + "_" + "2" ,
							"placeholder" : placeHolder,
							"title": "Ведомственные",
							"type" : "text",
							"class" : "rowCell maskFloat",
							"value" : (repId>0)?clone[1][key]:""//Math.random()*1000//"" //Math.random()*1000
						});
						elements1.html.push({
							"name" : key + "_" + "3" ,
							"id" :   key + "_" + "3" ,
							"placeholder" : placeHolder,
							"title": "Частные",
							"type" : "text",
							"class" : "rowCell maskFloat",
							"value" : (repId>0)?clone[2][key]:""//Math.random()*1000//"" //Math.random()*1000
						});

						elements1.html.push({
							"type" : "div",
							"class" : "rowEnd"
						});
						cnt ++;
						}
					}				
				} break;			
			case 'pmo6' :{
			}
			case 'pmo_6' :{
				if(repId>0){
					console.log(repId);
					$(MESS.PMO6).each(function(indx, element){
						if(element.id == repId){
							clone = element;
						}
					});	
					elements1.html.push({
						"name" : "recId",
						"id" : "recId",
						"type" : "hidden", 
						"value" :  clone.id								
					});					
				} else {
					elements1.html.push({
						"name" : "recId",
						"id" : "recId",
						"type" : "hidden",
						"value" :  "0"								
					});										
				}

				var arr = pmo6Field;
				var placeHolder = 'Значение'; var caption = '';
				var cnt = 0;
				for (key in arr){
//					console.log(arr[key]);
					
					if(ROUT.is_string(arr[key].label)){
						caption = ROUT.str_replace( '(', '<span class="hilight_2">', ROUT.str_replace( '[', '<span class="hilight_1">', ROUT.str_replace( ')', '</span>', ROUT.str_replace( ']', '</span>', arr[key].label ))));
						let classAdd = (arr[key].type == 'f') ? ' maskFloat ' : ' ';
						elements1.html.push({
							"type" : "div",
							"class" : "rowNum",
							"html" : (cnt+1)
						});
						if((arr[key].type != 'b')&&(arr[key].type != 'ta')){
							
							elements1.html.push({
								"name" : key + '_'+arr[key].type ,
								"id" :   key + '_'+arr[key].type,
								"caption" : caption,
								"placeholder" : placeHolder,
								"title": "значение",
								"type" : "text",
								"class" : "rowStart rowcell4 " + classAdd,
	//							"value" : (repId>0)?clone[0][key]:Math.random()*1000//"" //Math.random()*1000
								"value" : (repId>0)?clone[key]:"" 
							});
						} else if (arr[key].type == 'ta'){
							elements1.html.push({
								"name" : key + '_'+arr[key].type ,
								"id" :   key + '_'+arr[key].type,
								"caption" : caption,
								"placeholder" : placeHolder,
								"title": "значение",
								"type" : "textarea",
								"rows" : "6",
								"class" : "rowStart rowcell4 " + classAdd,
	//							"value" : (repId>0)?clone[0][key]:Math.random()*1000//"" //Math.random()*1000
								"value" : (repId>0)?clone[key]:"" 
							});
							
						}	else{
							if(repId>0){
								if(arr[key].options != undefined){
									for (el in arr[key].options){
										if(el ==  clone[key]){
											arr[key].options[el] = {"selected" : "selected","html" : el};
//											console.log(el, clone[key], arr[key].options[el]);
										}
									}
								}
							}
							var boolEl= {
								"name" : key + '_'+arr[key].type ,
								"id" :   key + '_'+arr[key].type,
								"caption" : caption,
								"class" : "rowStart rowcell4 ",
								"type" : "select",
								"options" : arr[key].options
							};							
							elements1.html.push(boolEl);
						}
						elements1.html.push({
							"type" : "div",
							"class" : "rowEnd"
						});
						cnt ++;
						}
					}
			
				} break;			
			case 'pmo7' :{
			}
			case 'pmo_7' :{
				if(repId>0){
					console.log(repId);
					$(MESS.PMO7).each(function(indx, element){
						if(element[0].sendDate == repId){
							clone = element;
						}
					});					
				}
				console.log(clone);
				var arr = pmo7Field;
				var placeHolder = 'Значение'; var caption = '';
				var cnt = 0;

						elements1.html.push({
							"type" : "div",
							"class" : "rowHeaderStart",
							"html" : ""
						});
						elements1.html.push({
									"type" : "div",
									"class" : "rowHeaderSingle1",
									"html" : "Жилой фонд"
								});							
						elements1.html.push({
									"type" : "div",
									"class" : "rowHeaderSingle2",
									"html" : "Объекты социальной сферы"
								});						
						
						elements1.html.push({
							"type" : "div",
							"class" : "rowEndStart"
						});						
						elements1.html.push({
							"type" : "div",
							"class" : "rowHeaderStart",
							"html" : ""
						});
						for (key in pmo7Head){
						elements1.html.push({
									"type" : "div",
									"class" : "rowHeader80",
									"style" : "background-color:" + pmo7Head[key].color,
//									"html" : pmo3Field[key].label
									"html" : ROUT.str_replace( '(', '<span class="hilight_2">', ROUT.str_replace( '[', '<span class="hilight_1">', ROUT.str_replace( ')', '</span>', ROUT.str_replace( ']', '</span>', pmo7Head[key].label ))))
								});		
						}
					
						elements1.html.push({
							"type" : "div",
							"class" : "rowEnd"
						});
//				arr.forEach(function(key, indx, arr){	
				for (key in arr){	
//					console.log(arr[key]);
					if(ROUT.is_string(arr[key].label)){
						caption = ROUT.str_replace( '(', '<span class="hilight_2">', ROUT.str_replace( '[', '<span class="hilight_1">', ROUT.str_replace( ')', '</span>', ROUT.str_replace( ']', '</span>', arr[key].label ))));

						elements1.html.push({
							"type" : "div",
							"class" : "rowNum",
							"html" : (cnt+1)
						});
						elements1.html.push({
							"name" : key + "_" + "1" ,
							"id" :   key + "_" + "1" ,
							"caption" : caption,
							"placeholder" : placeHolder,
							"title": pmo7Head[1].label,
							"type" : "text",
							"class" : "rowcell80 maskFloat rowStart",
							"value" : (repId>0)?clone[0][key]:""//Math.random()*1000//"" //Math.random()*1000
						});
						var count= 1;
						for (key1 in pmo7Head){
							if(count>1){
							elements1.html.push({
								"name" : key + "_" + count,
								"id" : key + "_" + count,
		//						"caption" : "",
								"placeholder" : placeHolder,
								"type" : "text",
								"title" : pmo7Head[key1].label,
								"class" : "rowcell80 maskFloat",								
								"value" : (repId>0)?clone[count-1][key]:""//Math.random()*1000//""								
							}); }
							count ++;
						}

						elements1.html.push({
							"type" : "div",
							"class" : "rowEnd"
						});
						cnt ++;
						}
					}				
				} break;			
			case 'pmo8' :{
			}
			case 'pmo_8' :{
				if(repId>0){
//					console.log(repId);
					$(MESS.PMO8).each(function(indx, element){
						if(element[0].sendDate == repId){
							clone = element;
						}
					});					
				}
				var arr = pmo8Field;
				var placeHolder = 'Значение'; var caption = '';
				var cnt = 0;
						elements1.html.push({
							"type" : "div",
							"class" : "rowHeaderStart",
							"html" : ""
						});
						elements1.html.push({
									"type" : "div",
									"class" : "rowHeader",
									"html" : "Муниципальные"
								});						
						elements1.html.push({
									"type" : "div",
									"class" : "rowHeader",
									"html" : "Ведомственные"
								});						
						elements1.html.push({
							"type" : "div",
							"class" : "rowEnd"
						});
//				arr.forEach(function(key, indx, arr){	
				for (key in arr){	
//					console.log(arr[key]);
					if(ROUT.is_string(arr[key].label)){
						var classNameAdd = ' ';
						var nameAdd = '';
						caption = ROUT.str_replace( '(', '<span class="hilight_2">', ROUT.str_replace( '[', '<span class="hilight_1">', ROUT.str_replace( ')', '</span>', ROUT.str_replace( ']', '</span>', arr[key].label ))));
//						let classNameAdd = (arr[key].type == 'f')? ' maskFloat ' : ' ';
						switch(arr[key].type){
							case 'f' : {
								classNameAdd = ' maskFloat ';
								nameAdd = '';
							} break;
							case 'fs' : {
								classNameAdd = ' maskFlSlash ';
								nameAdd = '_t';
							} break;
							case 't' : {
								classNameAdd = '  ';
								nameAdd = '_t';
							} break;
							default: {} ;
						}
						let elementType = (arr[key].type != 't')? 'text' : 'textarea';
//						let nameAdd = (arr[key].type != 't')? '' : '_t';

						elements1.html.push({
							"type" : "div",
							"class" : "rowNum",
							"html" : (cnt+1)
						});
						elements1.html.push({
							"name" : key + "_" + "1" + nameAdd,
							"id" :   key + "_" + "1" + nameAdd ,
							"caption" : caption,
							"placeholder" : placeHolder,
							"title": "Муниципальные",
							"type" : elementType,
							"rows" : "6",
							"class" : "rowcell rowStart "+ classNameAdd,
//							"class" : "rowCell rowStart",
							"value" : (repId>0)?clone[0][key]:""//Math.random()*1000//"" //Math.random()*1000
						});
						elements1.html.push({
							"name" : key + "_" + "2" + nameAdd ,
							"id" :   key + "_" + "2" + nameAdd ,
							"placeholder" : placeHolder,
							"title": "Ведомственные",
							"type" : elementType,
							"rows" : "6",
							"class" : "rowcell " + classNameAdd,
//							"class" : "rowCell",
							"value" : (repId>0)?clone[1][key]:""//Math.random()*1000//"" //Math.random()*1000
						});

						elements1.html.push({
							"type" : "div",
							"class" : "rowEnd"
						});
						cnt ++;
						}
					}				
				} break;			
			case 'pmo9' :{
			}
			case 'pmo_9' :{
				if(repId>0){
//					console.log(repId);
					$(MESS.PMO9).each(function(indx, element){
						if(element[0].sendDate == repId){
							clone = element;
						}
					});					
				}
				var arr = pmo9Field;
				var placeHolder = 'Значение'; var caption = '';
				var cnt = 0;
						elements1.html.push({
							"type" : "div",
							"class" : "rowHeaderStart",
							"html" : ""
						});
						elements1.html.push({
									"type" : "div",
									"class" : "rowHeader300",
									"html" : "Стационарных"
								});						
						elements1.html.push({
									"type" : "div",
									"class" : "rowHeader300",
									"html" : "Передвижных"
								});						
						elements1.html.push({
							"type" : "div",
							"class" : "rowEnd"
						});
//				arr.forEach(function(key, indx, arr){	
				for (key in arr){	
//					console.log(arr[key]);
					if(ROUT.is_string(arr[key].label)){
						caption = ROUT.str_replace( '(', '<span class="hilight_2">', ROUT.str_replace( '[', '<span class="hilight_1">', ROUT.str_replace( ')', '</span>', ROUT.str_replace( ']', '</span>', arr[key].label ))));

						elements1.html.push({
							"type" : "div",
							"class" : "rowNum",
							"html" : (cnt+1)
						});


						let classNameAdd = 	(arr[key].type == 'f')? ' maskFloat ' : ' ';
						let elementType = 	(arr[key].type == 'f')? 'text' : 'textarea';
						let nameAdd = 		(arr[key].type == 'f')? '' : '_t';
						elements1.html.push({
							"name" : key + "_" + "1"  + nameAdd,
							"id" :   key + "_" + "1"  + nameAdd,
							"caption" : caption,
							"placeholder" : placeHolder,
							"title": "Стационарных",
							"type" : elementType,
							"rows" : "6",
							"class" : "rowcell9 rowStart "+ classNameAdd,
							"value" : (repId>0)?clone[0][key]:"" //Math.random()*1000
						});
						elements1.html.push({
							"name" : key + "_" + "2"  + nameAdd,
							"id" :   key + "_" + "2"  + nameAdd,
							"placeholder" : placeHolder,
							"title": "Передвижных",
							"type" : elementType,
							"rows" : "6",
							"class" : "rowcell9 " + classNameAdd,
							"value" : (repId>0)?clone[1][key]:"" //Math.random()*1000
						});

						elements1.html.push({
							"type" : "div",
							"class" : "rowEnd"
						});
						cnt ++;
						}
					}				
				} break;			
			
		}
//		console.log(elements1);
		return elements1;
	}
}
